[
"A. T. Still University Kirksville College of Osteopathic Medicine",
"A. T. Still University School of Osteopathic Medicine in Arizona",
"Alabama College of Osteopathic Medicine",
"Albany Medical College",
"Albert Einstein College of Medicine",
"Alpert Medical School at Brown University",
"Arkansas College of Osteopathic Medicine",
"Baylor College of Medicine",
"Boonshoft School of Medicine at Wright State University",
"Boston University School of Medicine",
"Burrell College of Osteopathic Medicine at New Mexico State University",
"California Health Sciences University",
"California Northstate University College of Medicine",
"California University of Science and Medicine",
"Campbell University School of Osteopathic Medicine",
"Case Western Reserve University School of Medicine",
"Central Michigan University College of Medicine",
"Charles R. Drew University of Medicine and Science",
"Chicago Medical School of Rosalind Franklin University of Medicine and Science",
"Cleveland Clinic Lerner College of Medicine",
"College of Osteopathic Medicine of the Pacific",
"College of Osteopathic Medicine of the Pacific, Northwest",
"Columbia University Roy and Diana Vagelos College of Physicians and Surgeons",
"Cooper Medical School of Rowan University",
"Creighton University School of Medicine",
"City of New York School of Medicine",
"Dartmouth College Geisel School of Medicine",
"David Geffen School of Medicine at UCLA",
"Dell Medical School at The University of Texas at Austin",
"Des Moines University College of Osteopathic Medicine",
"Donald and Barbara School of Medicine at Hofstra/Northwell",
"Drexel University College of Medicine",
"Duke University School of Medicine",
"East Tennessee State University James H. Quillen College of Medicine",
"Eastern Virginia Medical School",
"Edward Via College of Osteopathic Medicine",
"Edward Via College of Osteopathic Medicine – Carolinas Campus",
"Emory University School of Medicine",
"Florida Atlantic University Charles E. Schmidt College of Medicine",
"Florida International University Herbert Wertheim College of Medicine",
"Florida State University College of Medicine",
"Frank H. Netter M.D. School of Medicine at Quinnipiac University",
"Geisinger Commonwealth School of Medicine",
"George Washington University Medical School",
"Georgetown University School of Medicine",
"Hackensack Meridian School of Medicine at Seton Hall University",
"Harvard Medical School",
"Howard University College of Medicine",
"Icahn School of Medicine at Mount Sinai",
"Idaho College of Osteopathic Medicine",
"Indiana University School of Medicine",
"Indiana University School of Medicine - Evansville",
"Jacobs School of Medicine and Biomedical Sciences, University at Buffalo",
"Joan C. Edwards School of Medicine at Marshall University",
"Johns Hopkins University School of Medicine",
"Kaiser Permanente Bernard J. Tyson School of Medicine",
"Kansas City University of Medicine and Biosciences College of Osteopathic Medicine",
"Keck School of Medicine of University of Southern California",
"Lake Erie College of Osteopathic Medicine",
"Lewis Katz School of Medicine, Temple University",
"Liberty University College of Osteopathic Medicine",
"Lincoln Memorial University DeBusk College of Osteopathic Medicine",
"Loma Linda University School of Medicine",
"Louisiana State University School of Medicine in New Orleans",
"Louisiana State University School of Medicine in Shreveport",
"Loyola University Chicago Stritch School of Medicine",
"Marian University College of Osteopathic Medicine",
"Mayo Clinic Alix School of Medicine",
"Mayo Clinic College of Medicine",
"Medical College of Georgia at Augusta University",
"Medical College of Wisconsin",
"Medical University of South Carolina College of Medicine",
"Meharry Medical College School of Medicine",
"Mercer University School of Medicine",
"Michigan State University College of Human Medicine",
"Michigan State University College of Osteopathic Medicine",
"Midwestern University Arizona College of Osteopathic Medicine",
"Midwestern University Chicago College of Osteopathic Medicine",
"Morehouse School of Medicine",
"New York Institute of Technology College of Osteopathic Medicine",
"New York Institute of Technology College of Osteopathic Medicine at Arkansas State University",
"New York Medical College",
"New York University Long Island School of Medicine",
"New York University School of Medicine",
"Noorda College of Osteopathic Medicine",
"Northeast Ohio Medical University College of Medicine",
"Northwestern University Feinberg School of Medicine",
"Nova Southeastern University Dr Kiran C. Patel College of Allopathic Medicine",
"Nova Southeastern University Dr. Kiran C. Patel College of Osteopathic Medicine",
"Oakland University William Beaumont School of Medicine",
"Ohio University Heritage College of Osteopathic Medicine",
"Oklahoma State University Center for Health Sciences College of Osteopathic Medicine",
"Oregon Health and Science University School of Medicine",
"Pacific Northwest University of Health Sciences",
"Pennsylvania State University College of Medicine",
"Perelman School of Medicine at the University of Pennsylvania",
"Philadelphia College of Osteopathic Medicine",
"Philadelphia College of Osteopathic Medicine – Georgia Campus",
"Ponce Health Sciences University",
"Rocky Vista University College of Osteopathic Medicine",
"Rocky Vista University College of Osteopathic Medicine – Southern Utah Campus",
"Rowan University School of Osteopathic Medicine",
"Rush Medical College",
"Rutgers New Jersey Medical School",
"Rutgers Robert Wood Johnson Medical School",
"Saint Louis University School of Medicine",
"Sam Houston State University College of Osteopathic Medicine",
"San Juan Bautista School of Medicine",
"Sanford School of Medicine of the University of South Dakota",
"Sidney Kimmel Medical College at Thomas Jefferson University",
"Southern Illinois University School of Medicine",
"Stanford University School of Medicine",
"State University of New York Downstate Medical Center College of Medicine",
"State University of New York Upstate Medical University",
"Stony Brook University School of Medicine",
"Texas Christian University and UNTHSC Fort Worth",
"Texas A&M Health Science Center College of Medicine",
"Texas Tech University Health Sciences Center Paul L. Foster School of Medicine",
"Texas Tech University Health Sciences Center School of Medicine",
"Brody School of Medicine at East Carolina University",
"Ohio State University College of Medicine",
"University of Arizona College of Medicine Phoenix",
"Touro College of Osteopathic Medicine - Middleton",
"Touro College of Osteopathic Medicine - Harlem",
"Touro University California College of Osteopathic Medicine",
"Touro University Nevada College of Osteopathic Medicine",
"Tufts University School of Medicine",
"Tulane University School of Medicine",
"University of Arkansas for Medical Sciences",
"University of California San Francisco - Medicine",
"Uniformed Services University of the Health Sciences F. Edward Hebert School of Medicine",
"Universidad Central del Caribe School of Medicine",
"University of Alabama School of Medicine",
"University of Arizona College of Medicine – Tucson",
"University of California, Davis School of Medicine",
"University of California, Irvine School of Medicine",
"University of California, Riverside School of Medicine",
"University of California, San Diego School of Medicine",
"University of Central Florida College of Medicine",
"University of Chicago Pritzker School of Medicine",
"University of Cincinnati College of Medicine",
"University of Colorado School of Medicine",
"University of Connecticut School of Medicine",
"University of Florida College of Medicine",
"University of Hawaii at Manoa John A. Burns School of Medicine",
"University of Houston College of Medicine",
"University of Illinois at Urbana-Champaign Carle Illinois College of Medicine",
"University of Illinois College of Medicine",
"University of Iowa Roy J. and Lucille A. Carver College of Medicine",
"University of Kansas School of Medicine",
"University of Kentucky College of Medicine",
"University of Louisville School of Medicine",
"University of Maryland School of Medicine",
"University of Massachusetts Medical School",
"University of Miami Leonard M. Miller School of Medicine",
"University of Michigan Medical School",
"University of Minnesota Medical School",
"University of Mississippi School of Medicine",
"University of Missouri-Columbia School of Medicine",
"University of Missouri–Kansas City School of Medicine",
"University of Nebraska College of Medicine",
"University of Nevada, Las Vegas School of Medicine",
"University of Nevada, Reno School of Medicine",
"University of New England College of Osteopathic Medicine",
"University of New Mexico School of Medicine",
"University of North Carolina School of Medicine",
"University of North Dakota School of Medicine and Health Sciences",
"University of North Texas Health Science Center Texas College of Osteopathic Medicine",
"University of Oklahoma College of Medicine",
"University of Oklahoma School of Community Medicine",
"University of Pikeville Kentucky College of Osteopathic Medicine",
"University of Pittsburgh School of Medicine",
"University of Puerto Rico School of Medicine",
"University of Rochester School of Medicine and Dentistry",
"University of South Alabama College of Medicine",
"University of South Carolina School of Medicine",
"University of South Carolina School of Medicine Greenville",
"University of South Florida College of Medicine",
"University of Tennessee College of Medicine",
"University of Texas Medical Branch School of Medicine",
"University of Texas Rio Grande Valley School of Medicine",
"University of Texas Southwestern Medical School at Dallas",
"University of the Incarnate Word School of Osteopathic Medicine",
"University of Toledo College of Medicine",
"University of Utah School of Medicine",
"University of Vermont College of Medicine",
"University of Virginia School of Medicine",
"University of Washington School of Medicine",
"University of Wisconsin School of Medicine and Public Health",
"Joe R. & Teresa Lozano Long School of Medicine at UTHealth",
"John P. and Kathrine G. McGovern Medical School at UTHealth",
"Vanderbilt University School of Medicine",
"Virginia Commonwealth University School of Medicine",
"Virginia Tech Carilion School of Medicine and Research Institute",
"Wake Forest School of Medicine",
"Washington State University Elson S. Floyd College of Medicine",
"Washington University School of Medicine",
"Wayne State University School of Medicine",
"Weill Cornell Medical College",
"West Virginia School of Osteopathic Medicine",
"West Virginia University School of Medicine",
"Western Michigan University Homer Stryker M.D. School of Medicine",
"Western University of Health Sciences",
"William Carey University College of Osteopathic Medicine",
"Yale School of Medicine",
"Afghan Swiss Medical Institute of Higher Education",
"Ahmad Shah Abdali Institute of Higher Education Faculty of Curative Medicine",
"Alberoni University Faculty of Medicine",
"Aria University Faculty of Medicine",
"Ariana Institute of Higher Education School of Curative Medical Sciences, Kabul",
"Ariana Institute of Higher Education School of Curative Medical Sciences, Nangarhar",
"Balkh University Faculty of Medicine",
"Bost University Faculty of Medicine",
"Cheragh Medical Institute",
"Dawat University Faculty of Medicine",
"Ghalib University Medical Science Faculty Herat",
"Ghalib University Medical Science Faculty Kabul",
"Hakim Sanayee University Faculty of Medicine",
"Herat University Faculty of Medicine",
"Kabul University of Medical Sciences Faculty of Medicine",
"Kandahar University Faculty of Medicine",
"Kateb University Faculty of Medicine",
"Khatam al Nabieen University Kabul Faculty of Medicine",
"Malalay Institute of Higher Education",
"Mawlana Jalaluddin Mohammad Balkhi University Faculty of Medicine",
"Meli Institute of Higher Education",
"Mirwais Neeka Institute of Higher Education",
"Moraa Medical School",
"Nangarhar University Faculty of Medicine",
"Paktia University Faculty of Medicine",
"Rahnaward Institute of Higher Education Faculty of Medicine",
"Rokhan Institute of Higher Education Faculty of Medicine",
"Shaikh Zayed Bin Sultan Al Nahyan University Faculty of Medicine",
"Spinghar Institute of Higher Education, Kabul",
"Spinghar Institute of Higher Education, Nangarhar",
"Taj Institute of Higher Education Faculty of Medicine",
"Wadi Helmand Institute of Higher Education Faculty of Medicine",
"Zawul Institute of Higher Education Faculty of Medicine",
"Our Lady of Good Counsel University Faculty of Medicine",
"University of Medicine of Tirana Faculty of Medicine",
"Université Abou Bekr Belkaid Tlemcen Faculté de Médecine",
"Université Badji Mokhtar d'Annaba Faculté de Médecine",
"Université Batna 2 Faculté de Médecine",
"Université Constantine 3 Faculté de Médecine",
"Université d'Alger Benyoucef Benkhedda Faculté des Sciences Médicales",
"Université d'Oran 1 Ahmed Ben Bella Faculté de Médecine",
"Université de Béjaïa Faculté de Médecine",
"Université de Mostaganem Abdelhamid Ibn Badis Faculté de Médecine",
"Université Djillali Liabes de Sidi Bel-Abbès Faculté de Sciences Médicales",
"Université Ferhat Abbas de Sétif (UFAS) Faculté de Médecine",
"Université Mouloud Mammeri de Tizi-Ouzou Faculté de Médecine",
"Université Saad Dahlab Blida Faculté de Médecine",
"Instituto Superior Técnico Militar",
"Universidade Agostinho Neto Faculdade de Medicina",
"Universidade Jean Piaget de Angola Faculdade de Ciências da Saúde",
"Universidade José Eduardo dos Santos Faculdade de Medicina",
"Universidade Katyavala Bwila Faculdade de Medicina",
"Universidade Lueji A'Nkonde Faculdade de Medicina",
"Universidade Mandume Ya Ndemufayo Faculdade de Medicina",
"Universidade Onze de Novembro Faculdade de Medicina",
"Universidade Privada de Angola Faculdade de Ciências da Saúde",
"American University of Antigua College of Medicine",
"Atlantic University School of Medicine",
"Metropolitan University College of Medicine",
"University of Health Sciences Antigua School of Medicine",
"Instituto Universitario CEMIC Escuela de Medicina",
"Instituto Universitario de Ciencias Biomédicas de Córdoba",
"Instituto Universitario de Ciencias de la Salud Facultad de Medicina, Sede Buenos Aires",
"Instituto Universitario de Ciencias de la Salud Facultad de Medicina, Sede La Rioja",
"Instituto Universitario de Ciencias de la Salud Facultad de Medicina, Sede Santo Tomé",
"Instituto Universitario Escuela de Medicina del Hospital Italiano",
"Instituto Universitario Italiano de Rosario Facultad de Medicina",
"Pontificia Universidad Católica Argentina Facultad de Ciencias Médicas",
"UniCen Escuela Superior de Ciencias de la Salud",
"Universidad Abierta Interamericana Facultad de Medicina y Ciencias de la Salud, Sede Buenos Aires",
"Universidad Abierta Interamericana Facultad de Medicina y Ciencias de la Salud, Sede Rosario",
"Universidad Adventista del Plata Facultad de Ciencias de la Salud",
"Universidad Austral Facultad de Ciencias Biomédicas",
"Universidad Católica de Cuyo Facultad de Ciencias Médicas San Juan",
"Universidad Católica de Cuyo Facultad de Ciencias Médicas San Luis",
"Universidad Católica de Córdoba Facultad de Medicina",
"Universidad Católica de las Misiones Facultad de Ciencias de la Salud",
"Universidad de Buenos Aires Facultad de Medicina",
"Universidad de Ciencias Empresariales y Sociales Facultad de Ciencias de la Salud",
"Universidad de Concepción del Uruguay Facultad de Ciencias Médicas 'Bartolomé Vassallo'",
"Universidad de Mendoza Facultad de Ciencias de la Salud",
"Universidad de Morón Facultad de Medicina",
"Universidad de San Pablo-T",
"Universidad del Aconcagua Facultad de Ciencias Médicas",
"Universidad del Salvador Facultad de Medicina",
"Universidad FASTA Facultad de Ciencias Médicas",
"Universidad Favaloro Facultad de Ciencias Médicas",
"Universidad Maimónides Escuela de Medicina",
"Universidad Nacional Arturo Jauretche Instituto de Ciencias de la Salud",
"Universidad Nacional de Cuyo Facultad de Ciencias Médicas",
"Universidad Nacional de Córdoba Facultad de Ciencias Médicas",
"Universidad Nacional de Entre Ríos Facultad de Ciencias de la Salud",
"Universidad Nacional de la Matanza Departamento de Ciencias de la Salud",
"Universidad Nacional de la Patagonia San Juan Bosco Facultad de Cs. Naturales y Cs. de la Salud",
"Universidad Nacional de la Plata Facultad de Ciencias Médicas",
"Universidad Nacional de La Rioja Escuela de Medicina",
"Universidad Nacional de Mar del Plata Escuela Superior de Medicina",
"Universidad Nacional de Rosario Facultad de Ciencias Médicas",
"Universidad Nacional de Santiago del Estero Facultad de Ciencias Médicas",
"Universidad Nacional de Tucumán Facultad de Medicina",
"Universidad Nacional de Tucumán Salta Facultad de Medicina",
"Universidad Nacional de Villa María Instituto Académico Pedagógico de Ciencias Humanas",
"Universidad Nacional del Chaco Austral",
"Universidad Nacional del Comahue Facultad de Ciencias Medicas",
"Universidad Nacional del Litoral Facultad de Ciencias Médicas",
"Universidad Nacional del Nordeste Facultad de Medicina",
"Universidad Nacional del Sur Facultad de Medicina",
"Armenian Medical Institute Faculty of Medicine",
"Armenian-Russian International University 'Mkhitar Gosh'",
"St. Tereza Medical University",
"Yerevan Haybusak University Faculty of Medicine",
"Yerevan State Medical University Named for Mkhitar Heratsi",
"Yerevan University of Traditional Medicine",
"Australian National University Medical School",
"Bond University Faculty of Health Sciences & Medicine",
"Curtin Medical School",
"Deakin University School of Medicine",
"Flinders University of South Australia School of Medicine",
"Griffith University School of Medicine",
"James Cook University College of Medicine and Dentistry",
"Macquarie University Faculty of Medicine & Health Sciences",
"Monash School of Medicine",
"The University of Western Australia Faculty of Health and Medical Sciences",
"University of Adelaide Faculty of Health and Medical Sciences",
"University of Melbourne Faculty of Medicine, Dentistry & Health Sciences",
"University of New England School of Rural Medicine",
"University of New South Wales Faculty of Medicine",
"University of Newcastle Faculty of Health and Medicine",
"University of Notre Dame Australia School of Medicine, Fremantle",
"University of Notre Dame Australia School of Medicine, Sydney",
"University of Queensland Faculty of Medicine",
"University of Sydney, Sydney Medical School",
"University of Tasmania School of Medicine",
"University of Wollongong School of Medicine",
"Western Sydney University School of Medicine",
"Johannes Kepler Universität Linz Medizinische Fakultät",
"Karl Landsteiner Privatuniversität für Gesundheitswissenschaften",
"Medizinische Universität Graz",
"Medizinische Universität Innsbruck",
"Medizinische Universität Wien",
"Paracelsus Medizinische Privatuniversität",
"Sigmund Freud Privatuniversität Medizinischen Fakultät",
"Azerbaijan Medical University",
"Nakhchivan State University Faculty of Medicine",
"Odlar Yurdu University Medical Faculty",
"Arabian Gulf University College of Medicine and Medical Sciences",
"Royal College of Surgeons in Ireland - Medical University of Bahrain",
"Abdul Malek Ukil Medical College",
"Ad-din Akij Medical College (AAMC)",
"Ad-din Sakina Medical College",
"Ad-din Women's Medical College",
"Anwer Khan Modern Medical College",
"Armed Forces Medical College (AFMC)",
"Army Medical College Bogra",
"Army Medical College Chattogram",
"Army Medical College Comilla",
"Army Medical College Jessore",
"Army Medical College Rangpur",
"Ashiyan Medical College",
"B.G.C. Trust Medical College",
"Bangladesh Medical College (BMSRI)",
"Barind Medical College and Hospital",
"Bashundhara Ad-din Medical College",
"Bikrampur Bhuiyan Medical College",
"Brahmanbaria Medical College",
"Central Medical College, Comilla",
"Chattagram Maa-O-Shishu Hospital Medical College",
"Chattogram International Medical College and Hospital",
"Chittagong Medical College and Hospital",
"City Medical College",
"Comilla Medical College & Hospital",
"Community Based Medical College, Bangladesh (CBMCB)",
"Cox's Bazar Medical College",
"Delta Medical College",
"Dhaka Central International Medical College and Hospital",
"Dhaka Community Medical College",
"Dhaka Medical College and Hospital",
"Dhaka National Medical College & Hospital",
"Diabetic Association Medical College",
"Dr. Sirajul Islam Medical College and Hospital",
"East West Medical College",
"Eastern Medical College, Comilla",
"Enam Medical College and Hospital",
"Faridpur Medical College & Hospital",
"Gazi Medical College",
"Gonoshasthaya Samaj Vittik Medical College",
"Green Life Medical College and Hospital",
"Holy Family Red Crescent Medical College",
"Ibn Sina Medical College",
"Ibrahim Medical College",
"Institute of Applied Health Sciences (IAHS)",
"International Medical College",
"Islami Bank Medical College",
"Jahurul Islam Medical College & Hospital",
"Jalalabad Ragib-Rabeya Medical College",
"Jessore Medical College",
"Khulna Medical College",
"Khwaja Yunus Ali Medical College",
"Kumudini Women's Medical College",
"Kushtia Medical College",
"M Abdur Rahim Medical College",
"M.H. Samorita Hospital and Medical College",
"Mainamoti Medical College",
"Marine City Medical College",
"Marks Medical College and Hospital",
"Medical College for Women & Hospital",
"Monno Medical College",
"Mymensingh Medical College",
"North Bengal Medical College",
"North East Medical College",
"Northern International Medical College",
"Northern Private Medical College",
"Pabna Medical College",
"Parkview Medical College and Hospital",
"Popular Medical College and Hospital",
"President Abdul Hamid Medical College and Hospital",
"Prime Medical College",
"Rajshahi Medical College & Hospital",
"Rangamati Medical College",
"Rangpur Community Medical College",
"Rangpur Medical College",
"Satkhira Medical College",
"Shahabuddin Medical College",
"Shaheed Monsur Ali Medical College",
"Shaheed Suhrawardy Medical College",
"Shaheed Syed Nazrul Islam Medical College",
"Shaheed Tajuddin Ahmad Medical College",
"Shaheed Ziaur Rahman Medical College",
"Sheikh Hasina Medical College Tangail",
"Sheikh Sayera Khatun Medical College",
"Sher-E-Bangla Medical College",
"Sir Salimullah Medical College",
"Southern Medical College & Hospital",
"Sylhet M.A.G. Osmani Medical College",
"Sylhet Women's Medical College and Hospital",
"T.M.S.S. Medical College",
"Tairunnessa Memorial Medical College and Hospital",
"Universal Medical College",
"US-Bangla Medical College and Hospital",
"Uttara Adhunik Medical College",
"Zainul Haque Sikder Women's Medical College & Hospital",
"American University of Barbados School of Medicine",
"American University of Integrative Sciences School of Medicine",
"Bridgetown International University School of Medicine",
"International University of Barbados School of Medicine",
"Ross University School of Medicine",
"University of the West Indies at Cave Hill Faculty of Medical Sciences",
"Victoria University of Barbados School of Medicine",
"Washington University of Barbados School of Medicine",
"Belarusian State Medical University",
"Gomel State Medical University",
"Grodno State Medical University",
"Vitebsk State Medical University",
"Katholieke Universiteit Leuven (KULeuven) Faculteit Geneeskunde",
"Universiteit Antwerpen Faculteit Geneeskunde en Gezondheidswetenschappen",
"Universiteit Gent Faculteit Geneeskunde en Gezondheidswetenschappen",
"Université catholique de Louvain Faculté de Médecine et de Médecine Dentaire",
"Université de Liège Faculté de Médecine",
"Université Libre de Bruxelles Faculté de Médecine",
"Vrije Universiteit Brussel Faculteit Geneeskunde & Farmacie",
"Central America Health Sciences University Belize Medical College",
"Columbus Central University School of Medicine",
"Washington University of Health and Sciences",
"Université d'Abomey-Calavi Faculté des Sciences de la Santé",
"Université de Parakou Faculté de Médecine",
"Universidad Amazónica de Pando Área de Ciencias de la Salud",
"Universidad Autónoma del Beni 'José Ballivián' Facultad Ciencias de la Salud",
"Universidad Autónoma Gabriel René Moreno Facultad de Ciencias de la Salud Humana",
"Universidad Autónoma Gabriel René Moreno Facultad Integral del Norte",
"Universidad Autónoma Juan Misael Saracho Facultad de Ciencias de la Salud",
"Universidad Autónoma Tomás Frías Facultad de Medicina",
"Universidad Boliviana de Informática",
"Universidad Católica Boliviana San Pablo Facultad de Medicina",
"Universidad Central (UNICEN) Sede Central",
"Universidad Central (UNICEN) Subsede La Paz",
"Universidad Cristiana de Bolivia (UCEBOL)",
"Universidad de Aquino Bolivia Facultad de Ciencias de la Salud, Sede Cochabamba",
"Universidad de Aquino Bolivia Facultad de Ciencias de la Salud, Sede La Paz",
"Universidad de Aquino Bolivia Facultad de Ciencias de la Salud, Sede Oruro",
"Universidad de Aquino Bolivia Facultad de Ciencias de la Salud, Sede Santa Cruz",
"Universidad Latinoamericana Facultad en Ciencias de la Salud",
"Universidad Mayor de San Andrés Facultad de Medicina",
"Universidad Mayor de San Simón Facultad de Medicina",
"Universidad Mayor, Real y Pontificia de San Francisco Xavier de Chuquisaca Facultad de Medicina",
"Universidad Nacional 'Siglo XX' Área de la Salud",
"Universidad Nacional del Oriente",
"Universidad Nacional Ecologica (UNE)",
"Universidad Nuestra Señora de La Paz Facultad de Medicina",
"Universidad Privada Abierta Latinoamericana Sede Cochabamba Escuela de Medicina",
"Universidad Privada Abierta Latinoamericana Subsede Oruro",
"Universidad Privada de Oruro",
"Universidad Privada del Valle Facultad de Ciencias de la Salud",
"Universidad Privada del Valle Subsede La Paz Facultad de Ciencias de la Salud",
"Universidad Privada Franz Tamayo Facultad de Ciencias de la Salud, Cochabamba",
"Universidad Privada Franz Tamayo Facultad de Ciencias de la Salud, El Alto",
"Universidad Privada Franz Tamayo Facultad de Ciencias de la Salud, La Paz",
"Universidad Privada Franz Tamayo Facultad de Ciencias de la Salud, Santa Cruz",
"Universidad Pública de El Alto Área de Ciencias de la Salud",
"Universidad Técnica de Oruro Facultad de Ciencias de la Salud",
"Universidad Técnica Privada Cosmos Facultad Ciencias de la Salud Cochabamba",
"Universidad Técnica Privada Cosmos Subsede Cobija",
"Universidad Técnica Privada Cosmos Subsede El Alto",
"Universidad Técnica Privada Cosmos Subsede Provincia Germán Busch",
"American Northwest University School of Medicine",
"International University of Goražde Faculty of Health Sciences",
"Sarajevo Medical School, Sarajevo School of Science and Technology",
"University of Banja Luka Faculty of Medicine",
"University of East Sarajevo Faculty of Medicine",
"University of Mostar Faculty of Medicine",
"University of Sarajevo Faculty of Medicine",
"University of Tuzla Faculty of Medicine",
"University of Botswana School of Medicine",
"Centro Universitário Atenas (UniAtenas)",
"Centro Universitário Barão de Mauá (CUBM)",
"Centro Universitário Campo Real",
"Centro Universitário Católico Salesiano Auxilium (UniSalesiano), Campus Araçatuba",
"Centro Universitário Cesmac",
"Centro Universitário Christus (Unichristus)",
"Centro Universitário Claretiano (CEUCLAR) Rio Claro",
"Centro Universitário das Faculdades Associadas de Ensino",
"Centro Universitário de Adamantina (UniFAI)",
"Centro Universitário de Anápolis (UniEVANGÉLICA)",
"Centro Universitário de Belo Horizonte (Uni-BH)",
"Centro Universitário de Brasília (UniCEUB) Faculdade de Ciências da Educação e Saúde",
"Centro Universitário de Caratinga (UNEC)",
"Centro Universitário de Goiatuba (UNICERRADO)",
"Centro Universitário de João Pessoa (UNIPÊ)",
"Centro Universitário de Maringá (UniCesumar)",
"Centro Universitário de Mineiros (UNIFIMES) Câmpus Mineiros",
"Centro Universitário de Mineiros (UNIFIMES) Câmpus Trindade",
"Centro Universitário de Pato Branco (UNIDEP)",
"Centro Universitário de Patos de Minas (UNIPAM)",
"Centro Universitário de Valença (UNIFAA)",
"Centro Universitário de Volta Redonda (UniFOA) Escola de Ciências Médicas de Volta Redonda",
"Centro Universitário de Votuporanga (UNIFEV)",
"Centro Universitário de Várzea Grande (UNIVAG)",
"Centro Universitário do Espirito Santo (UNESC)",
"Centro Universitário do Estado do Pará (CESUPA)",
"Centro Universitário Estácio de Ribeirão Preto",
"Centro Universitário FAMINAS, Muriaé",
"Centro Universitário Franciscano (UNIFRA)",
"Centro Universitário Governador Ozanam Coelho (UNIFAGOC)",
"Centro Universitário Ingá (UNINGÁ)",
"Centro Universitário Integrado",
"Centro Universitário Lusíada Faculdade de Ciências Médicas de Santos",
"Centro Universitário Mauricio de Nassau (UNINASSAU)",
"Centro Universitário Max Planck (UniMAX)",
"Centro Universitário Municipal de Franca (Uni-FACEF)",
"Centro Universitário Nilton Lins (UNINILTONLINS)",
"Centro Universitário para o Desenvolvimento do Alto Vale do Itajaí (UNIDAVI)",
"Centro Universitário Serra dos Órgãos (UNIFESO) Centro de Ciências da Saúde",
"Centro Universitário São Camilo, São Paulo (SCAMILO)",
"Centro Universitário São Lucas",
"Centro Universitário Tiradentes",
"Centro Universitário Tocantinense Presidente Antônio Carlos (UNITPAC)",
"Centro Universitário UNIFAS",
"Centro Universitário UniFG",
"Centro Universitário UNINOVAFAPI Faculdade de Saúde, Ciências Humanas e Tecnologia do Piauí",
"Centro Universitário UniRedentor",
"Centro Universitário UnirG",
"Escola Bahiana de Medicina e Saúde Pública (EBMSP)",
"Escola de Medicina Anhembi Morumbi (UAM)",
"Escola de Medicina Souza Marques (EMSM), Fundação Tecnico Educação Souza Marques",
"Escola Superior de Ciências da Santa Casa de Misericórdia de Vitória Faculdade de Medicina",
"Escola Superior de Ciências da Saúde (ESCS)",
"Faculdade AGES de Medicina",
"Faculdade Alfredo Nasser",
"Faculdade Assis Gurgacz",
"Faculdade Atenas de Passos",
"Faculdade Atenas de Sete Algoas",
"Faculdade Barão do Rio Branco (FAB)",
"Faculdade Brasileira - Multivix Vitória",
"Faculdade Ceres (FACERES)",
"Faculdade da Saúde e Ecologia Humana (FASEH)",
"Faculdade das Américas (FAM)",
"Faculdade de Ciências Biomédicas de Cacoal (UNIFACIMED)",
"Faculdade de Ciências da Saúde de Barretos Dr. Paulo Prata (FACISB)",
"Faculdade de Ciências Gerenciais de Manhuaçu (FACIG)",
"Faculdade de Ciências Humanas, Exatas e da Saúde do Piauí (FAHESP/IESVAP)",
"Faculdade de Ciências Médicas da Paraíba (FCMPB)",
"Faculdade de Ciências Médicas da Santa Casa de São Paulo (FCMSCSP)",
"Faculdade de Ciências Médicas de Campina Grande (FCM)",
"Faculdade de Ciências Médicas de Minas Gerais (FCMMG)",
"Faculdade de Ciências Médicas de São José dos Campos (Humanitas)",
"Faculdade de Ciências Médicas de Três Rios",
"Faculdade de Ciências Médicas e da Saúde de Juiz de Fora - Suprema",
"Faculdade de Educação e Cultura de Vilhena (UNESC Vilhena)",
"Faculdade de Ensino Superior da Amazônia Reunida (FESAR)",
"Faculdade de Medicina de Bahia, Universidade Federal da Bahia (UFBA)",
"Faculdade de Medicina de Barbacena (FAME-FUNJOB)",
"Faculdade de Medicina de Campos (FMC)",
"Faculdade de Medicina de Catanduva, Faculdades Integradas Padre Albino (FIPA)",
"Faculdade de Medicina de Itajubá (FMIt)",
"Faculdade de Medicina de Jundiaí (FMJ)",
"Faculdade de Medicina de Marília (FAMEMA)",
"Faculdade de Medicina de Olinda",
"Faculdade de Medicina de Petrópolis / Faculdade Arthur Sá Earp Neto (FMP/Fase)",
"Faculdade de Medicina de Ribeirão Preto (FMRP-USP)",
"Faculdade de Medicina de São Francisco de Barreiras (FASB)",
"Faculdade de Medicina de São José do Rio Preto (FAMERP)",
"Faculdade de Medicina do ABC (FMABC), Fundação Universitária do ABC",
"Faculdade de Medicina Estácio de Juazeiro do Norte (Estácio FMJ)",
"Faculdade de Medicina Nova Esperança (FAMENE)",
"Faculdade de Medicina Pitágoras de Eunápolis",
"Faculdade de Medicina Santo Agostinho de Itabuna (FASA)",
"Faculdade de Minas, Belo Horizonte (FAMINAS-BH)",
"Faculdade de Tecnologica e Ciências (FTC Salvador) Curso de Medicina",
"Faculdade Dinâmica do Vale do Piranga (FADIP)",
"Faculdade Evangélica Mackenzie do Paraná Faculdade de Medicina",
"Faculdade Integrada Tiradentes, Universidade Tiradentes",
"Faculdade Integral Diferencial, Piaui (FACID)",
"Faculdade Israelita de Ciências da Saúde Albert Einstein (FICSAE)",
"Faculdade Meridional (IMED) Escola de Saúde",
"Faculdade Metropolitana da Amazônia (FAMAZ)",
"Faculdade Metropolitana de Manaus (FAMETRO)",
"Faculdade Metropolitana São Carlos (FAMESC)",
"Faculdade Morgana Potrich (FAMP)",
"Faculdade Nova Esperança de Mossoró",
"Faculdade Pernambucana de Saúde (FPS)",
"Faculdade Presidente Antonio Carlos (FAPAC)",
"Faculdade Santa Marcelina (FASM)",
"Faculdade Santa Maria (FSM)",
"Faculdade São Leopoldo Mandic, Araras",
"Faculdade São Leopoldo Mandic, Campinas",
"Faculdade Tiradentes de Jaboatão dos Guararapes (FITS)",
"Faculdades de Dracena (Unifadra)",
"Faculdades Integradas Aparício Carvalho (FIMCA)",
"Faculdades Integradas da União Educacional do Planalto Central (FACIPLAC)",
"Faculdades Integradas de Patos (FIP)",
"Faculdades Integradas Padrão (FIP Guanambi)",
"Faculdades Integradas Pitágoras (FIP-MOC)",
"Faculdades Pequeno Principe (FPP)",
"Faculdades Santo Agostinho, Vitória da Conquista",
"Fundação Educacional do Município de Assis",
"Fundação Universidade Federal de Rondônia (UNIR) Núcleo de Saúde",
"Fundação Universidade Norte Mineira de Ensino Superior Faculdade de Medicina do Norte de Minas",
"Instituto de Ciências da Saúde (ICS/FUNORTE)",
"Instituto de Ensino Superior Presidente Tancredo de Almeida Neves (IPTAN)",
"Instituto Master de Ensino Presidente Antônio Carlos (IMEPAC)",
"Instituto Metropolitano de Ensino Superior (IMES)",
"Instituto Superior de Teologia Aplicada",
"Pontifícia Universidade Católica de Campinas (PUC-Campinas) Faculdade de Ciências Médicas",
"Pontifícia Universidade Católica de Goiás (PUC Goiás)",
"Pontifícia Universidade Católica de Minas Gerais (PUC Minas) Betim",
"Pontifícia Universidade Católica de Minas Gerais (PUC Minas) Contagem",
"Pontifícia Universidade Católica de Minas Gerais (PUC Minas) Poços de Caldas",
"Pontifícia Universidade Católica de São Paulo (PUCSP) Faculdade de Medicina",
"Pontifícia Universidade Católica do Paraná Escola de Medicina, Câmpus Curitiba",
"Pontifícia Universidade Católica do Paraná Escola de Medicina, Câmpus Londrina",
"Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS) Faculdade de Medicina",
"Universidade Alto Vale do Rio do Peixe (UNIARP)",
"Universidade Anhanguera (UNIDERP)",
"Universidade Anhembi-Morumbi (UAM) Piracicaba",
"Universidade Anhembi-Morumbi (UAM) São José dos Campos",
"Universidade Brasil",
"Universidade Católica de Brasília (UCB)",
"Universidade Católica de Pelotas (UCPEL) Faculdade de Medicina",
"Universidade Católica de Pernambuco (UNICAP)",
"Universidade Ceuma, Campus Imperatriz",
"Universidade Ceuma, Campus Renascença São Luís",
"Universidade Cidade de São Paulo (UNICID) Faculdade de Medicina",
"Universidade Comunitária da Região de Chapecó (UNOCHAPECÓ)",
"Universidade da Região de Joinville (UNIVILLE)",
"Universidade de Araraquara (UNIARA)",
"Universidade de Brasília (UnB) Faculdade de Medicina",
"Universidade de Caxias do Sul (UCS) Faculdade de Medicina",
"Universidade de Cuiabá (UNIC) Faculdade de Medicina",
"Universidade de Fortaleza (UNIFOR)",
"Universidade de Franca (UNIFRAN)",
"Universidade de Itaúna (UIt)",
"Universidade de Marília (UNIMAR) Faculdade de Medicina e Enfermagem",
"Universidade de Mogi das Cruzes (UMC) Faculdade de Medicina",
"Universidade de Passo Fundo (UPF) Faculdade de Medicina",
"Universidade de Pernambuco (UPE), Campus Garanhuns",
"Universidade de Pernambuco (UPE), Campus Santo Amaro",
"Universidade de Pernambuco (UPE), Campus Serra Talhada",
"Universidade de Ribeirão Preto (UNAERP) Faculdade de Medicina",
"Universidade de Rio Verde (UniRV), Campus Aparecida de Goiânia",
"Universidade de Rio Verde (UniRV), Campus Goianésia",
"Universidade de Rio Verde (UniRV), Campus Rio Verde",
"Universidade de Santa Cruz do Sul (UNISC)",
"Universidade de Santo Amaro (UNISA) Faculdade de Medicina",
"Universidade de São Paulo Faculdade de Medicina São Paulo (FMSP-USP)",
"Universidade de Taubaté (UNITAU) Faculdade de Medicina",
"Universidade de Uberaba (UNIUBE) Faculdade de Medicina",
"Universidade de Vassouras Faculdade de Medicina",
"Universidade do Contestado (UnC)",
"Universidade do Estado da Bahia (UNEB)",
"Universidade do Estado de Mato Grosso (UNEMAT)",
"Universidade do Estado de Minas Gerais (UEMG)",
"Universidade do Estado do Amazonas (UEA) Escola Superior de Ciências da Saúde",
"Universidade do Estado do Pará Faculdade de Medicina Belém",
"Universidade do Estado do Pará Faculdade de Medicina Santarém",
"Universidade do Estado do Rio de Janeiro (UERJ) Faculdade de Ciências Médicas",
"Universidade do Estado do Rio Grande do Norte (UERN) Faculdade de Ciências da Saúde",
"Universidade do Extremo Sul Catarinense (UNESC/RCT)",
"Universidade do Oeste de Santa Catarina (UNOESC)",
"Universidade do Oeste Paulista (UNOESTE) Jaú",
"Universidade do Oeste Paulista (UNOESTE) Presidente Prudente",
"Universidade do Planalto Catarinense (UNIPLAC)",
"Universidade do Sul de Santa Catarina (UNISUL) Palhoça",
"Universidade do Sul de Santa Catarina (UNISUL) Tubarão",
"Universidade do Vale do Itajaí (UNIVALI)",
"Universidade do Vale do Rio dos Sinos (UNISINOS) Escola de Salud",
"Universidade do Vale do Taquari (UNIVATES) Centro de Ciências Biológicas e da Saúde",
"Universidade Estadual de Campinas (UNICAMP) Faculdade de Ciências Médicas",
"Universidade Estadual de Ciências da Saúde de Alagoas (UNCISAL) Faculdade de Medicina",
"Universidade Estadual de Feira de Santana (UEFS) Colegiado do Curso de Medicina",
"Universidade Estadual de Goiás, Unidade Universitária de Itumbiara, Câmpus Sudeste",
"Universidade Estadual de Londrina (UEL) Faculdade de Medicina",
"Universidade Estadual de Maringá (UEM) Centro de Ciências da Saúde",
"Universidade Estadual de Mato Grosso do Sul (UEMS)",
"Universidade Estadual de Montes Claros (UNIMONTES) Centro de Ciências Biológicas e da Saúde",
"Universidade Estadual de Ponta Grossa (UEPG) Faculdade de Medicina",
"Universidade Estadual de Santa Cruz (UESC)",
"Universidade Estadual do Ceará (UECE)",
"Universidade Estadual do Maranhão (UEMA)",
"Universidade Estadual do Oeste do Paraná (UNIOESTE) Campus de Cascavel",
"Universidade Estadual do Oeste do Paraná (UNIOESTE) Campus de Francisco Beltrão",
"Universidade Estadual do Piauí (UESPI) Faculdade de Ciências Médicas (FACIME)",
"Universidade Estadual do Sudoeste da Bahia (UESB) Colegiado de Medicina",
"Universidade Estadual do Sudoeste da Bahia (UESB), Jequié",
"Universidade Estadual Paulista 'Júlio de Mesquita Filho' (UNESP) Faculdade de Medicina",
"Universidade Estácio de Sá Faculdade de Medicina João Uchoa",
"Universidade Estácio de Sá Faculdade de Medicina Presidente Vargas",
"Universidade Estácio de Sá, Campus Angra dos Reis",
"Universidade Federal da Bahia Instituto Multidisciplinar em Saúde, Campus Anísio Teixeira",
"Universidade Federal da Fronteira Sul (UFFS), Campus Chapecó",
"Universidade Federal da Fronteira Sul (UFFS), Campus Passo Fundo",
"Universidade Federal da Grande Dourados (UFGD) Faculdade de Ciências da Saúde",
"Universidade Federal da Integração Latino-Americana (UNILA)",
"Universidade Federal da Paraíba (UFPB) Centro de Ciências Médicas",
"Universidade Federal de Alagoas (UFAL) Faculdade de Medicina",
"Universidade Federal de Alagoas, Campus Arapiraca",
"Universidade Federal de Alfenas (UNIFAL)",
"Universidade Federal de Campina Grande (UFCG) Cajazeiras Faculdade de Medicina",
"Universidade Federal de Campina Grande (UFCG) Faculdade de Medicina",
"Universidade Federal de Ciências da Saúde de Porto Alegre (UFCSPA) Faculdade de Medicina",
"Universidade Federal de Goiás (UFG) Faculdade de Medicina Goiânia",
"Universidade Federal de Goiás (UFG) Faculdade de Medicina Jataí",
"Universidade Federal de Juiz de Fora (UFJF) Faculdade de Medicina Governador Valadares",
"Universidade Federal de Juiz de Fora (UFJF) Faculdade de Medicina Juiz de Fora",
"Universidade Federal de Lavras (UFLA)",
"Universidade Federal de Mato Grosso (UFMT), Campus Cuiabá",
"Universidade Federal de Mato Grosso (UFMT), Campus Rondonópolis",
"Universidade Federal de Mato Grosso (UFMT), Campus Sinop",
"Universidade Federal de Mato Grosso do Sul (UFMS) Faculdade de Medicina Campo Grande",
"Universidade Federal de Mato Grosso do Sul (UFMS) Faculdade de Medicina Três Lagoas",
"Universidade Federal de Minas Gerais (UFMG) Faculdade de Medicina",
"Universidade Federal de Ouro Preto (UFOP)",
"Universidade Federal de Pelotas (UFPel) Faculdade de Medicina",
"Universidade Federal de Pernambuco (UFPE) Faculdade de Medicina Caruaru",
"Universidade Federal de Pernambuco (UFPE) Faculdade de Medicina Recife",
"Universidade Federal de Piauí (UFPI) Faculdade de Medicina",
"Universidade Federal de Roraima (UFRR) Faculdade de Medicina",
"Universidade Federal de Santa Catarina (UFSC) Araranguá",
"Universidade Federal de Santa Catarina (UFSC) Florianópolis",
"Universidade Federal de Santa Maria (UFSM) Faculdade de Medicina",
"Universidade Federal de Sergipe (UFS) Campus Aracaju",
"Universidade Federal de Sergipe (UFS) Campus Lagarto",
"Universidade Federal de São Carlos (UFSCAR)",
"Universidade Federal de São João del Rei (UFSJ), Campus Centro-Oeste Dona Lindu",
"Universidade Federal de São João del Rei (UFSJ), Campus Dom Bosco",
"Universidade Federal de São Paulo (UNIFESP) Faculdade de Medicina",
"Universidade Federal de Uberlândia (UFU) Faculdade de Medicina",
"Universidade Federal de Viçosa (UFV)",
"Universidade Federal do Acre (UFAC)",
"Universidade Federal do Amazonas (UFAM) Faculdade de Medicina",
"Universidade Federal do Cariri Faculdade de Medicina",
"Universidade Federal do Ceará Faculdade de Medicina Fortaleza",
"Universidade Federal do Ceará Faculdade de Medicina Sobral",
"Universidade Federal do Espírito Santo (UFES) Faculdade de Medicina",
"Universidade Federal do Estado do Amapá (UNIFAP)",
"Universidade Federal do Estado do Rio de Janeiro (UNIRIO) Escola de Medicina e Cirurgia",
"Universidade Federal do Maranhão (UFMA) Faculdade de Medicina Imperatriz",
"Universidade Federal do Maranhão (UFMA) Faculdade de Medicina Pinheiro",
"Universidade Federal do Maranhão (UFMA) Faculdade de Medicina São Luís",
"Universidade Federal do Oeste da Bahia (UFOB) Centro das Ciências Biológicas e da Saúde",
"Universidade Federal do Pampa",
"Universidade Federal do Paraná (UFPR) Faculdade de Medicina",
"Universidade Federal do Pará (UFPA) Faculdade de Medicina",
"Universidade Federal do Piauí (UFPI) Campus Ministro Reis Velloso",
"Universidade Federal do Piauí (UFPI) Campus Senador Elvídio Nuñes de Barros",
"Universidade Federal do Recôncavo da Bahia (UFRB) Centro de Ciências da Saúde",
"Universidade Federal do Rio de Janeiro (UFRJ) Faculdade de Medicina",
"Universidade Federal do Rio de Janeiro (UFRJ) Macaé Faculdade de Medicina",
"Universidade Federal do Rio Grande (FURG) Faculdade de Medicina",
"Universidade Federal do Rio Grande do Norte (UFRN) Faculdade de Medicina Caicó",
"Universidade Federal do Rio Grande do Norte (UFRN) Faculdade de Medicina Natal",
"Universidade Federal do Rio Grande do Sul (UFRGS) Faculdade de Medicina",
"Universidade Federal do Sul da Bahia (UFSB) Centro de Formação em Ciências da Saúde",
"Universidade Federal do Tocantins (UFT)",
"Universidade Federal do Triângulo Mineiro, Uberaba (UFTM) Faculdade de Medicina",
"Universidade Federal do Vale do São Francisco (UNIVASF), Campus Sede",
"Universidade Federal do Vale do São Francisco, Campus Paulo Afonso",
"Universidade Federal dos Vales do Jequitinhonha e Mucuri Faculdade de Medicina Diamantina",
"Universidade Federal dos Vales do Jequitinhonha e Mucuri Faculdade de Medicina Teófilo Otoni",
"Universidade Federal Fluminense (UFF) Faculdade de Medicina",
"Universidade Federal Rural do Semi-Árido",
"Universidade Feevale Novo Hamburgo",
"Universidade Iguaçu (UNIG) Faculdade de Ciências Biológicas e da Saúde Itaperuna",
"Universidade Iguaçu (UNIG) Faculdade de Ciências Biológicas e da Saúde Nova Iguaçu",
"Universidade José do Rosário Vellano (UNIFENAS) Faculdade de Medicina Alfenas",
"Universidade José do Rosário Vellano (UNIFENAS) Faculdade de Medicina Belo Horizonte",
"Universidade Luterana do Brasil (ULBRA) Faculdade de Medicina",
"Universidade Metropolitana de Santos (UNIMES) Faculdade de Ciências Médicas",
"Universidade Municipal de São Caetano do Sul Escola de Saúde, Campus Centro SCS",
"Universidade Municipal de São Caetano do Sul Escola de Saúde, São Paulo",
"Universidade Nove de Julho (UNINOVE) Campus Guarulhos",
"Universidade Nove de Julho (UNINOVE) Campus Mauá",
"Universidade Nove de Julho (UNINOVE) Campus Osasco",
"Universidade Nove de Julho (UNINOVE) Campus São Bernardo do Campo",
"Universidade Nove de Julho (UNINOVE) Campus Vergueiro",
"Universidade Paranaense (UNIPAR) Umuarama",
"Universidade Positivo (UP)",
"Universidade Potiguar (UnP) Escola de Saúde",
"Universidade Presidente Antônio Carlos Faculdade de Medicina de Juiz de Fora",
"Universidade Regional de Blumenau (FURB) Faculdade de Medicina",
"Universidade Regional Integrada do Alto Uruguai e das Missões",
"Universidade Salvador (UNIFACS)",
"Universidade São Francisco (USF) Faculdade de Ciências Médicas",
"Universidade São Judas Tadeu (USJT) Cubatão",
"Universidade Unigranrio Escola de Ciências da Saúde, Campus Duque de Caxias",
"Universidade Unigranrio Escola de Ciências da Saúde, Unidade Barra da Tijuca",
"Universidade Vale do Rio Doce",
"Universidade Vale do Rio Verde (UninCor)",
"Universidade Vila Velha (UVV)",
"UNIVÁS Faculdade de Ciências da Saúde Dr. José Antônio Garcia Coutinho",
"União das Faculdades dos Grandes Lagos",
"Medical University 'Prof. Dr. Paraskev Stoyanov' Varna Faculty of Medicine",
"Medical University of Plovdiv Faculty of Medicine",
"Medical University of Sofia Faculty of Medicine",
"Pleven Medical University",
"Sofia University St. Kliment Ohridski Faculty of Medicine",
"Trakia University Faculty of Medicine",
"Université Joseph Ki-Zerbo l'Unité de Formation et de Recherche en Sciences de la Santé",
"Faculté de Médecine de Bujumbura, Université du Burundi",
"Frank Ogden School of Medicine at Hope Africa University",
"Université de Ngozi Faculté de Médecine",
"International University Faculty of Health Sciences",
"University of Puthisastra Faculty of Health Sciences",
"Université des Sciences de la Santé Faculté de Médecine",
"Institut Supérieure de Technologie Médicale (ISTM) Faculté de Médecine",
"University of Bamenda Faculty of Health Sciences",
"University of Buea Faculty of Health Sciences",
"Université de Douala Faculté de Médecine et Sciences Pharmaceutiques",
"Université de Yaoundé I Faculté de Médecine et des Sciences Biomédicales",
"Université des Montagnes Institut Supérieur des Sciences de la Santé",
"Cumming School of Medicine, University of Calgary",
"Dalhousie University Faculty of Medicine",
"Max Rady College of Medicine, University of Manitoba",
"McGill University Faculty of Medicine and Health Sciences",
"Memorial University of Newfoundland Faculty of Medicine",
"Michael G. DeGroote School of Medicine, McMaster University",
"Northern Ontario School of Medicine",
"Queen's University Faculty of Health Sciences",
"Schulich School of Medicine and Dentistry, Western University",
"University of Alberta Faculty of Medicine and Dentistry",
"University of British Columbia Faculty of Medicine",
"University of Ottawa Faculty of Medicine",
"University of Saskatchewan College of Medicine",
"University of Toronto Faculty of Medicine",
"Université de Montréal Faculté de Médecine",
"Université de Sherbrooke Faculté de Médecine et des Sciences de la Santé",
"Université Laval Faculté de Médecine",
"Université de Bangui Faculté de Sciences de la Santé",
"Faculté de Médecine Bon Samaritain",
"Faculté des Sciences de la Santé, N'Djamena",
"Pontificia Universidad Católica de Chile Escuela de Medicina",
"Universidad Andres Bello Facultad de Medicina Viña del Mar",
"Universidad Andrés Bello Facultad de Medicina Concepción",
"Universidad Andrés Bello Facultad de Medicina Santiago",
"Universidad Austral de Chile Facultad de Medicina",
"Universidad Autónoma de Chile Facultad de Ciencias de la Salud Providencia",
"Universidad Autónoma de Chile Facultad de Ciencias de la Salud Talca",
"Universidad Católica de la Santísima Concepción Facultad de Medicina",
"Universidad Católica del Maule Facultad de Medicina",
"Universidad Católica del Norte Facultad de Medicina",
"Universidad de Antofagasta Facultad de Medicina y Odontología",
"Universidad de Atacama Facultad de Medicina",
"Universidad de Chile Facultad de Medicina",
"Universidad de Concepción Facultad de Medicina",
"Universidad de la Frontera Facultad de Medicina",
"Universidad de Los Andes Facultad de Medicina (Chile)",
"Universidad de Magallanes Escuela de Medicina",
"Universidad de Santiago de Chile Facultad de Ciencias Médicas",
"Universidad de Talca Escuela de Medicina",
"Universidad de Tarapacá Escuela de Medicina",
"Universidad de Valparaíso Facultad de Medicina San Felipe",
"Universidad de Valparaíso Facultad de Medicina Valparaíso",
"Universidad del Desarrollo Facultad de Medicina, Sede Santiago",
"Universidad Diego Portales Facultad de Medicina",
"Universidad Finis Terrae Facultad de Medicina",
"Universidad Mayor Facultad de Medicina",
"Universidad Pedro de Valdivia Facultad de Ciencias Médicas",
"Universidad San Sebastián Facultad de Medicina Concepción",
"Universidad San Sebastián Facultad de Medicina De la Patagonia",
"Universidad San Sebastián Facultad de Medicina Santiago",
"Academy of Military Medical Sciences Faculty of Medicine",
"Air Force Medical University",
"Anhui Medical University Faculty of Medicine",
"Anhui University of Chinese Medicine",
"Anhui University of Science and Technology College of Medicine",
"Army Medical University",
"Baotou Medical College",
"Beihua University School of Medicine",
"Bengbu Medical College",
"Binzhou Medical College",
"Capital Medical University",
"Changchun University of Traditional Chinese Medicine",
"Changsha Medical University",
"Changzhi Medical College",
"Chengde Medical University",
"Chengdu Institute of Physical Education",
"Chengdu Medical College",
"Chengdu University of Traditional Chinese Medicine",
"Chifeng University Medical College",
"China Medical University",
"Chongqing Medical University",
"Dali University School of Medicine",
"Dalian Medical University",
"Fujian College of Traditional Chinese Medicine",
"Fujian Medical University",
"Gannan Medical University",
"Gansu College of Traditional Chinese Medicine",
"Guangdong Medical University",
"Guangdong Pharmaceutical University",
"Guangdong Provincial Cardiovascular Institute",
"Guangxi Medical University",
"Guangxi University of Chinese Medicine",
"Guangzhou Medical University",
"Guangzhou University of Chinese Medicine",
"Guilin Medical University",
"Guizhou Medical University",
"Hainan Medical University",
"Hangzhou Medical College",
"Hangzhou School of Medicine, Hangzhou Normal University",
"Harbin Medical University",
"He University School of Clinical Medicine",
"Hebei Medical University",
"Hebei North University Faculty of Medicine",
"Hebei University Medical College",
"Hebei University of Engineering School of Medicine",
"Henan University of Traditional Chinese Medicine",
"Henan University School of Medicine",
"Heze Medical College",
"Huanghe Science and Technology College",
"Hubei Minzu University Medical School",
"Hubei Polytechnic University School of Medicine",
"Hubei University of Arts and Science Medical College",
"Hubei University of Chinese Medicine First Clinical College",
"Hubei University of Medicine",
"Hubei University of Science and Technology Faculty of Medicine",
"Hunan Normal University College of Medicine",
"Hunan University of Chinese Medicine",
"Inner Mongolia Medical University",
"Inner Mongolia University for the Nationalities",
"Jiamusi University School of Medicine",
"Jianghan University School of Medicine",
"Jiangnan University Wuxi Medical College",
"Jiangsu University School of Medicine",
"Jiangxi Medical College of Nanchang University",
"Jiaxing University College of Medicine",
"Jilin Medical University",
"Jinan University School of Medicine",
"Jinggangshan University Medical School",
"Jining Medical University",
"Jinzhou Medical University",
"Jishou University School of Medicine",
"Jiujiang University Medical College",
"Jixi Medical School for the Coal Industry",
"Kunming Medical University",
"Lanzhou University Faculty of Medicine",
"Medical College of China Three Gorges University",
"Medical College of Dalian University",
"Medical College of Henan University of Science and Technology",
"Medical College of Nanjing University",
"Medical College of Nankai University",
"Medical College of Wuhan University of Science and Technology",
"Medical College of Yan'an University",
"Mudanjiang Medical University",
"Nanjing Medical University",
"Nanjing University of Chinese Medicine",
"Nantong University Medical School",
"Nantong University Xinglin College Faculty of Medicine",
"Naval Medical University",
"Ningbo University Medical School",
"Ningxia Medical University",
"Norman Bethune Health Science Center of Jilin University",
"North China University of Science and Technology College of Medicine",
"North Sichuan Medical College",
"Northwest University for Nationalities College of Medicine",
"Panzhihua University School of Medical Science",
"Peking Union Medical University",
"Peking University Health Science Center",
"Putian University School of Medicine",
"Qingdao University College of Medical Science",
"Qinghai University Medical College",
"Qiqihar Medical University",
"Sanquan Medical College",
"School of Medicine, General Logistics Department",
"School of Traditional Chinese Medicine of Capital Medical University",
"Shaanxi University of Chinese Medicine",
"Shandong First Medical University",
"Shandong Medical College",
"Shandong University Cheeloo College of Medicine",
"Shandong University of Traditional Chinese Medicine",
"Shanghai Jiao Tong University School of Medicine",
"Shanghai Medical College, Fudan University",
"Shanghai School of Medicine",
"Shantou University Medical College",
"Shanxi Datong University School of Medicine",
"Shanxi Medical University",
"Shaoxing University Medical School",
"Shenyang Medical College",
"Shenzhen University College of Medicine",
"Shihezi University School of Medicine",
"Soochow University Medical College",
"Southeast University Medical College",
"Southern Medical University",
"Southwest Medical University",
"Taizhou University Medical School",
"Tianjin Medical University Clinical Medical College",
"Tianjin Medical University School of Basic Medical Sciences",
"Tibet University Medical College",
"Tongji Medical College of Huazhong University of Science & Technology",
"Tongji University School of Medicine",
"Tsinghua University School of Medicine",
"University of South China Faculty of Medicine",
"Wannan Medical College",
"Weifang Medical University",
"Wenzhou Medical University",
"West China College of Medicine, Sichuan University",
"Wuhan University School of Medicine",
"Xi'an Jiaotong University College of Medicine",
"Xi'an Medical University",
"Xiamen University School of Medicine",
"Xiangnan University School of Medicine",
"Xiangya School of Medicine, Central South University",
"Xinjiang College of Traditional Chinese Medicine",
"Xinjiang Medical University",
"Xinxiang Medical University",
"Xuzhou Medical University",
"Yanbian University Health Science Center",
"Yangtze University Medical School",
"Yangzhou University College of Medicine",
"Yichun University School of Medicine",
"Youjiang Medical College for Nationalities",
"Zhang Zhongjing School of Traditional Chinese Medicine",
"Zhejiang Chinese Medical University",
"Zhejiang University School of Medicine",
"Zhengzhou University Medical School",
"Zhongshan School of Medicine, Sun Yat-Sen University",
"Zunyi Medical University",
"Corporación Universitaria Rafael Núñez Facultad de Ciencias de la Salud",
"Corporación Universitaria Remington Facultad de Ciencias de la Salud",
"Fundación Universitaria Autónoma de las Américas Facultad de Medicina",
"Fundación Universitaria de Ciencias de la Salud (FUCS) Facultad de Medicina",
"Fundación Universitaria Juan N. Corpas",
"Fundación Universitaria Navarra (UniNavarra) Facultad de Ciencias de la Salud",
"Fundación Universitaria San Martín Facultad de Medicina Bogotá",
"Fundación Universitaria San Martín Facultad de Medicina Pasto",
"Fundación Universitaria Sanitas Facultad de Medicina",
"Pontificia Universidad Javeriana Bogotá Facultad de Medicina",
"Pontificia Universidad Javeriana Cali Facultad de Ciencias de la Salud",
"Unidad Central del Valle del Cauca Facultad Ciencias de la Salud",
"Universidad Antonio Nariño Facultad de Medicina",
"Universidad Autónoma de Bucaramanga Facultad de Medicina",
"Universidad CES Escuela de Medicina",
"Universidad Cooperativa de Colombia Escuela de Medicina, Medellin",
"Universidad Cooperativa de Colombia Facultad de Ciencias de la Salud, Santa Marta",
"Universidad Cooperativa de Colombia Facultad de Medicina, Pasto",
"Universidad Cooperativa de Colombia Facultad de Medicina, Villavicencio",
"Universidad de Antioquia Facultad de Medicina",
"Universidad de Boyacá Facultad de Ciencias de la Salud",
"Universidad de Caldas Facultad de Ciencias para la Salud",
"Universidad de Cartagena Facultad de Medicina",
"Universidad de Ciencias Aplicadas y Ambientales Facultad de Ciencias Médicas",
"Universidad de la Sabana Facultad de Medicina",
"Universidad de Los Andes Facultad de Medicina (Colombia)",
"Universidad de Manizales Campo de Ciencias de la Salud",
"Universidad de Pamplona Facultad de Salud",
"Universidad de Santander (UDES) Facultad de Ciencias de la Salud",
"Universidad del Cauca Facultad de Ciencias de la Salud",
"Universidad del Magdalena Facultad de Ciencias de la Salud",
"Universidad del Norte Programa de Medicina",
"Universidad del Quindío Facultad de Ciencias de la Salud",
"Universidad del Rosario Escuela de Medicina y Ciencias de la Salud",
"Universidad del Sinú Elias Bechara Zainúm Escuela de Medicina Cartagena",
"Universidad del Sinú Facultad de Ciencias de la Salud Montería",
"Universidad del Tolima Facultad de Ciencias de la Salud",
"Universidad del Valle Escuela de Medicina, Cali",
"Universidad El Bosque, Escuela Medicina Colombiana",
"Universidad ICESI Facultad de Ciencias de la Salud",
"Universidad Industrial de Santander Escuela de Medicina",
"Universidad Libre de Cali Facultad de Ciencias de la Salud",
"Universidad Libre de Colombia Facultad de Ciencias de la Salud",
"Universidad Metropolitana Programa de Medicina",
"Universidad Militar Nueva Granada Facultad de Medicina",
"Universidad Nacional de Colombia Facultad de Medicina",
"Universidad Pedagógica y Tecnológica de Colombia Facultad de Ciencias de la Salud",
"Universidad Pontificia Bolivariana Facultad de Medicina",
"Universidad Santiago de Cali Facultad de Salud, Campus Palmira",
"Universidad Santiago de Cali Facultad de Salud, Campus Pampalinda",
"Universidad Simón Bolívar Facultad de Ciencias de la Salud",
"Universidad Surcolombiana Facultad de la Salud",
"Universidad Tecnológica de Pereira Facultad de Ciencias de la Salud",
"The International Medical Education-Comoro Islands (IME-CI)",
"Université Marien Ngouabi Faculté des Sciences de la Santé",
"Université Catholique de Bukavu Faculté de Médecine",
"Université Catholique du Graben Faculté de Médecine",
"Université Chrétienne de Kinshasa (UCKin) Faculté de Médecine",
"Université Chrétienne Internationale Faculté de Médecine",
"Université de Goma Faculté de Médecine",
"Université de Kindu Faculté de Médecine",
"Université de Kinshasa Faculté de Médecine",
"Université de Kisangani Faculté de Médecine et de Pharmacie",
"Université de Lubumbashi Faculté de Médecine",
"Université Kongo Faculté de Médecine",
"Université Mbujimayi Faculté de Médecine",
"Université Notre Dame du Kasayi Faculté de Médecine",
"Université Officielle de Bukavu Faculté de Médecine",
"Université Protestante au Congo Faculté de Médecine",
"Université Président Joseph Kasa-Vubu Faculté de Médecine",
"Université Simon Kimbangu Faculté de Médecine Humaine",
"Université Téchnologique Bel Campus Faculté de Médecine",
"Université Évangélique en Afrique Faculté de Médecine et Santé Communautaire",
"Universidad Autónoma de Centro América Facultad de Ciencias de la Salud",
"Universidad de Ciencias Medicas Andrés Vesalio Guzmán (UCIMED) Escuela de Medicina",
"Universidad de Costa Rica Facultad de Medicina",
"Universidad de Iberoamérica Escuela de Medicina",
"Universidad Federada San Judas Tadeo Escuela de Medicina",
"Universidad Hispanoamericana",
"Universidad Internacional de las Américas Escuela de Medicina y Cirugía",
"Universidad Latina de Costa Rica Facultad de Ciencias de la Salud, Escuela de Medicina",
"Medicinski Fakultet Osijek",
"Medicinski Fakultet u Splitu",
"Medicinski Fakultet, Sveučilišta u Zagrebu",
"University of Rijeka Faculty of Medicine",
"Escuela Latinoamericana de Medicina",
"Facultad de Ciencias Médicas de Granma 'Celia Sanchez Manduley'",
"Facultad de Ciencias Médicas Matanzas 'Juan Guiteras Gener'",
"Universidad de Ciencias Médicas de Camagüey",
"Universidad de Ciencias Médicas de Ciego de Avila Facultad de Medicina",
"Universidad de Ciencias Médicas de Cienfuegos",
"Universidad de Ciencias Médicas de Guantánamo",
"Universidad de Ciencias Médicas de Holguín",
"Universidad de Ciencias Médicas de la Habana",
"Universidad de Ciencias Médicas de Las Tunas Facultad de Medicina",
"Universidad de Ciencias Médicas de Pinar del Río",
"Universidad de Ciencias Médicas de Santiago de Cuba",
"Universidad de Ciencias Médicas de Villa Clara Facultad de Medicina",
"Universidad de Ciencias Médicas Sancti Spiritus",
"European University Cyprus School of Medicine",
"Near East University Faculty of Medicine",
"University of Cyprus Medical School",
"University of Nicosia Medical School",
"Lékařská Fakulta, Univerzity Karlovy",
"Fakulta Vojenského Zdravotnictví, Univerzity Obrany",
"Lékařská Fakulta UK v Hradci Králové",
"Lékařská Fakulta v Plzni, Univerzita Karlova v Praze",
"Masarykova Univerzita Lékařská Fakulta",
"Ostravská Univerzita v Ostravě Lékařská Fakulta",
"Univerzity Palackého v Olomouci Lékařská Fakulta",
"UFR des Sciences Médicales, Université Félix Houphouët-Boigny",
"Université Alassane Ouattara UFR Sciences Médicales",
"Aalborg Universitet Det Sundhedsvidenskabelige Fakultet",
"Aarhus University Faculty of Health",
"Københavns Universitet Det Sundhedsvidenskabelige og Medicinsk Fakultet",
"Syddansk Universitet Det Sundhedsvidenskabelige Fakultet",
"Université de Djibouti Faculté de Médecine",
"All Saints University School of Medicine, Dominica",
"Instituto Tecnológico de Santo Domingo (INTEC) Facultad de Ciencias de la Salud",
"O&Med Medical School, Universidad Dominicana O&M",
"Pontificia Universidad Católica Madre y Maestra (PUCMM) Facultad de Ciencias de la Salud",
"Universidad Autónoma de Santo Domingo Facultad de Ciencias de la Salud",
"Universidad Católica Nordestana (UCNE) Facultad de Ciencias Medicas",
"Universidad Católica Tecnológica del Cibao (UCATECI) Escuela de Medicina",
"Universidad Central del Este (UCE) Facultad de Medicina",
"Universidad Eugenio Maria de Hostos Escuela de Medicina",
"Universidad Iberoamericana (UNIBE) School of Medicine, Santo Domingo",
"Universidad Nacional Pedro Henríquez Ureña (UNPHU) Escuela de Medicina",
"Universidad Tecnológica de Santiago Escuela de Medicina, Santiago Campus",
"Universidad Tecnológica de Santiago Escuela de Medicina, Santo Domingo Campus",
"Escuela Superior Politécnica de Chimborazo Facultad de Salud Pública",
"Pontificia Universidad Católica del Ecuador Facultad de Medicina",
"Universidad Católica de Cuenca Azogues Facultad de Medicina",
"Universidad Católica de Cuenca Unidad Académica de Salud y Bienestar",
"Universidad Católica de Santiago de Guayaquil Facultad de Ciencias Médicas",
"Universidad Central del Ecuador Facultad de Ciencias Médicas",
"Universidad de Cuenca Facultad de Ciencias Médicas",
"Universidad de Guayaquil Facultad de Ciencias Médicas",
"Universidad de Las Américas Facultad de Ciencias de la Salud",
"Universidad del Azuay Facultad de Medicina",
"Universidad Internacional del Ecuador Facultad de Ciencias Médicas y de la Salud",
"Universidad Laica 'Eloy Alfaro' de Manabí Facultad de Ciencias Médicas",
"Universidad Nacional de Chimborazo Facultad de Ciencias de la Salud",
"Universidad Nacional de Loja Área de la Salud Humana",
"Universidad Particular de Especialidades Espiritu Santo (UEES) Facultad de Ciencias Médicas",
"Universidad Regional Autónoma de los Andes Facultad Ciencias Médicas",
"Universidad San Francisco de Quito Colegio de Ciencias de la Salud",
"Universidad Tecnólogica Equinoccial Facultad de Ciencias de la Salud Eugenio Espejo",
"Universidad Técnica de Ambato Facultad de Ciencias de la Salud",
"Universidad Técnica de Machala Escuela de Ciencias Médicas",
"Universidad Técnica de Manabí Facultad de Ciencias de la Salud",
"Universidad Técnica Particular de Loja Escuela de Medicina",
"Ain Shams University Faculty of Medicine",
"Al-Azhar Faculty of Medicine for Men in Asyut",
"Al-Azhar University Faculty of Medicine for Boys",
"Al-Azhar University Faculty of Medicine for Girls",
"Alexandria University Faculty of Medicine",
"Armed Forces College of Medicine (AFCM)",
"Assiut University Faculty of Medicine",
"Aswan University Faculty of Medicine",
"Beni Suef University Faculty of Medicine",
"Cairo University Faculty of Medicine",
"College of Human Medicine Benha University",
"Damietta Faculty of Medicine, Al-Azhar University",
"Fayoum University Faculty of Medicine",
"Helwan University Faculty of Medicine",
"Kafrelsheikh University Faculty of Medicine",
"Mansoura University Faculty of Medicine",
"Menoufia University Faculty of Medicine",
"Minia University Faculty of Medicine",
"Misr University for Science and Technology College of Medicine",
"Nahda University in Beni Suef Faculty of Medicine",
"Newgiza University School of Medicine",
"October 6 University Faculty of Medicine",
"Port Said University Faculty of Medicine",
"Qena Faculty of Medicine, South Valley University",
"Sohag University Faculty of Medicine",
"Suez Canal University Faculty of Medicine",
"Suez University Faculty of Medicine",
"Tanta University Faculty of Medicine",
"Zagazig University Faculty of Medicine",
"Universidad Autónoma de Santa Ana Facultad de Medicina",
"Universidad Católica de El Salvador Facultad de Ciencias de la Salud",
"Universidad de El Salvador Facultad de Medicina",
"Universidad de El Salvador Facultad Multidisciplinaria de Occidente",
"Universidad de El Salvador Facultad Multidisciplinaria de Oriente",
"Universidad Dr. José Matías Delgado Facultad de Ciencias de la Salud Dr. Luis Edmundo Vásquez",
"Universidad Evangélica de El Salvador Facultad de Medicina",
"Universidad Nueva San Salvador Facultad de Ciencias de la Salud",
"Universidad Salvadoreña Alberto Masferrer Facultad de Medicina",
"Orotta School of Medicine and Dentistry",
"University of Tartu Faculty of Medicine",
"Adama General Hospital and Medical College",
"Adama Hospital Medical College",
"Addis Ababa University, College of Health Sciences, School of Medicine",
"Adigrat University College of Medicine and Health Science",
"Africa Medical College",
"Aksum University College of Health Science",
"Ambo University Medical School",
"Arba Minch University College of Medicine and Health Sciences",
"Arsi University College of Health Sciences",
"Bahir Dar University College of Medicine and Health Sciences",
"Bethel Medical College",
"Debre Berhan University School of Health Science",
"Debre Markos University School of Medicine",
"Debre Tabor University College of Medicine and Health Science",
"Defense University College of Health Sciences",
"Dilla University School of Health and Medical Science",
"Dire Dawa University School of Medicine",
"Ethiopian Catholic University of St. Thomas Aquinas (ECUSTA) School of Medicine",
"Gamby College of Medical Science",
"Haramaya University College of Health and Medical Sciences",
"Hawassa University College of Medicine and Health Science",
"Hayat Medical College",
"Jigjiga University College of Medicine and Health Science",
"Jimma University College of Public Health and Medical Sciences",
"Madda Walabu University College of Medicine",
"Mekelle University College of Health Sciences",
"Mizan-Tepi University College of Health Science",
"MyungSung Medical College",
"Santé Medical College",
"St. Paul's Hospital Millennium Medical College",
"University of Gondar College of Medicine and Health Sciences",
"Wachemo University College of Medicine and Health Sciences",
"Wolaita Sodo University College of Health Sciences and Medicine",
"Wolkite University College of Medicine and Health Sciences",
"Wollega University College of Medical and Health Sciences",
"Wollo University College of Medicine and Health Sciences",
"Yekatit 12 Hospital Medical College",
"Yirgalem Hospital Medical College",
"Fiji National University College of Medicine, Nursing & Health Sciences",
"Umanand Prasad School of Medicine, University of Fiji",
"Tampere University Faculty of Medicine and Health Technology",
"University of Eastern Finland School of Medicine",
"University of Helsinki Faculty of Medicine",
"University of Oulu Faculty of Medicine",
"University of Turku Faculty of Medicine",
"Faculté de Médecine de Lille, Université Lille 2 Droit et Santé",
"Faculté de Médecine de Limoges, Université de Limoges",
"Faculté de Médecine de Nancy, Université de Lorraine",
"Faculté de Médecine de Reims, Université de Reims Champagne-Ardenne",
"Faculté de Médecine de Rennes, Université de Rennes 1",
"Faculté de Médecine de Sorbonne Université",
"Faculté de Médecine de Tours, Université François-Rabelais",
"Faculté de Médecine et de Maïeutique Lyon Sud Charles Mérieux",
"Faculté de Médecine et de Pharmacie de Besançon, Université de Franche-Comté",
"Faculté de Médecine et de Pharmacie de Grenoble, Université Grenoble Alpes",
"Faculté de Médecine et de Pharmacie, Université de Poitiers",
"Faculté de Médecine et de Pharmacie, Université de Rouen-Haute Normandie",
"Faculté de Médecine et des Sciences de la Santé de Brest, UBO",
"Faculté de Médecine et Maïeutique, Université Catholique de Lille",
"Faculté de Médecine Hyacinthe Bastaraud, Université des Antilles et de la Guyane",
"Faculté de Médecine Jacques Lisfranc, Université Jean Monnet Saint-Etienne",
"Faculté de Médecine Lyon Est",
"Faculté de Médecine Montpellier-Nîmes, Université Montpellier 1",
"Faculté de Médecine Paris-Sud",
"Faculté de Médecine Toulouse-Purpan",
"Faculté de Médecine Toulouse-Rangueil",
"Faculté de Médecine, Université de Nantes",
"Faculté des Sciences Fondamentales et Biomédicales, Université Paris Descartes",
"Faculté des Sciences Médicales et Paramédicales Université d’Aix-Marseille AMU",
"UFR de Médecine de Paris Centre",
"UFR de Médecine de Paris Nord",
"UFR de Médecine et Professions Paramédicales, Université Clermont-Auvergne",
"UFR de Médecine, Université de Picardie Jules Verne",
"UFR de Santé, Médecine et Biologie Humaine, Université Paris 13",
"UFR des Sciences de la Santé Simone Veil",
"UFR des Sciences de Santé de Dijon, Université de Bourgogne",
"UFR Santé de l'Université Caen Normandie",
"Unité de Formation et de Recherche Santé, Université de la Réunion",
"Université Côte d'Azur Faculté de Médecine",
"Université d'Angers Faculté de Santé",
"Université de Bordeaux UFR de Médecine",
"Université de Strasbourg Faculté de Médecine",
"UPEC Faculté de Médecine, Université Paris-Est Créteil Val de Marne",
"Université des Sciences de la Santé Faculté de Médecine",
"American International University West Africa College of Medicine",
"School of Medicine and Allied Health Sciences (SMAHS), University of the Gambia",
"Akaki Tsereteli State University Faculty of Medicine",
"Batumi Shota Rustaveli State University Faculty of Natural Sciences and Health Care",
"BAU International University Faculty of Medicine",
"Caucasus International University Faculty of Medicine",
"Caucasus University School of Medicine and Healthcare Management",
"David Aghmashenebeli University of Georgia Faculty of Medicine",
"David Tvildiani Medical University AIETI Medical School",
"East European University Faculty of Healthcare Sciences",
"European University Faculty of Medicine",
"Georgian American University",
"Georgian National University SEU Faculty of Medicine",
"Grigol Robakidze University School of Medicine",
"Ilia State University Faculty of Natural Sciences and Medicine",
"Ivane Javakhishvili Tbilisi State University Faculty of Medicine",
"Kutaisi University Faculty of Medicine",
"New Vision University School of Medicine",
"Petre Shotadze Tbilisi Medical Academy Faculty of Medicine",
"Tbilisi Open Teaching University School of Medicine",
"Tbilisi State Medical University Faculty of Medicine",
"Teaching University Geomedi Faculty of Medicine",
"University of Georgia School of Health Sciences and Public Health",
"Albert-Ludwigs-Universität Freiburg Medizinische Fakultät",
"Charité-Universitätsmedizin Berlin Medizinische Fakultät",
"Christian-Albrechts-Universität zu Kiel Medizinische Fakultät",
"Eberhard Karls Universität Tübingen Medizinische Fakultät",
"European Medical School, Carl von Ossietzky Universität Oldenburg",
"Friedrich-Alexander-Universität Erlangen-Nürnberg Medizinische Fakultät",
"Friedrich-Schiller-Universität Jena Medizinische Fakultät",
"Goethe-Universität Frankfurt am Main Fachbereich Medizin",
"Heinrich-Heine-Universität Düsseldorf Medizinische Fakultät",
"Julius-Maximilians-Universität Würzburg Medizinische Fakultät",
"Justus-Liebig-Universität Giessen Fachbereich Medizin",
"Ludwig-Maximilians-Universität München Medizinische Fakultät",
"Martin-Luther-Universität Halle-Wittenberg Medizinische Fakultät",
"Medizinische Fakultät Carl Gustav Carus, Technische Universität Dresden",
"Medizinische Fakultät Heidelberg, Ruprecht-Karls-Universität Heidelberg",
"Medizinische Fakultät Mannheim, Ruprecht-Karls-Universität Heidelberg",
"Medizinische Hochschule Brandenburg Theodor Fontane",
"Medizinische Hochschule Hannover",
"Medizinische Hochschule Lübeck, Universität Lübeck",
"Medizinischen Fakultät der Universität des Saarlandes",
"Otto-von-Guericke-Universität Magdeburg Medizinische Fakultät",
"Philipps-Universität Marburg Fachbereich Medizin",
"Rheinisch-Westfälische Technische Hochschule Aachen Medizinische Fakultät",
"Rheinischen Friedrich-Wilhelms-Universität Bonn Medizinische Fakultät",
"Ruhr-Universität Bochum Medizinische Fakultät",
"Technischen Universität München Fakultät für Medizin",
"Universität Duisburg-Essen Medizinische Fakultät",
"Universität Hamburg Medizinische Fakultät",
"Universität Leipzig Medizinische Fakultät",
"Universität Regensburg Fakultät für Medizin",
"Universität Rostock Medizinische Fakultät",
"Universität Ulm Medizinische Fakultät",
"Universität Witten/Herdecke Fakultät für Gesundheit",
"Universität zu Köln Medizinische Fakultät",
"Universitätsmedizin der Johannes Gutenberg-Universität Mainz",
"Universitätsmedizin Greifswald",
"Universitätsmedizin Göttingen Medizinische Fakultät",
"Westfälische Wilhelms-Universität Medizinische Fakultät",
"Accra College of Medicine",
"Family Health University Medical School",
"Kwame Nkrumah University of Science & Technology School of Medical Sciences",
"University for Development Studies School of Medicine and Health Sciences",
"University of Cape Coast School of Medical Sciences",
"University of Ghana Medical School",
"University of Health and Allied Sciences School of Medicine",
"Aristotle University of Thessaloniki Medical School",
"Demokritos University of Thrace Department of Medicine",
"University of Athens School of Health Sciences",
"University of Crete Faculty of Medicine",
"University of Ioannina Medical School",
"University of Patras School of Health Sciences",
"University of Thessalia Faculty of Medicine",
"St. George's University School of Medicine",
"Universidad de San Carlos Facultad de Ciencias Médicas",
"Universidad Francisco Marroquín Facultad de Medicina",
"Universidad Mariano Gálvez de Guatemala Facultad de Ciencias Médicas y de la Salud",
"Universidad Mesoamericana de Quetzaltenango Facultad de Medicina",
"Universidad Rafael Landívar Facultad de Ciencias de la Salud",
"Université Gamal Abdel Nasser de Conakry Faculté de Médecine, Pharmacie et Odonto-Stomatologie",
"Escola Superior de Medicina Eduardo Mondlane",
"American International School of Medicine",
"Georgetown American University School of Medicine",
"GreenHeart Medical University School of Medicine",
"Lincoln American University School of Medicine",
"Rajiv Gandhi University of Science and Technology School of Medicine",
"Texila American University College of Medicine",
"University of Guyana School of Medicine",
"Université d'Etat d'Haïti Faculté de Médecine et de Pharmacie",
"Université de la Fondation Dr. Aristide Faculté de Médecine",
"Université Joseph Lafortune",
"Université Lumière Faculté de Médecine et des Sciences de la Santé",
"Université Notre Dame d'Haïti Faculté de Médecine",
"Université Quisqueya Faculté des Sciences de la Santé",
"Université Royale d'Haïti Faculté des Sciences de la Santé",
"Universidad Católica de Honduras Nuestra Señora Reina de la Paz Facultad en Ciencias de la Salud",
"Universidad Nacional Autónoma de Honduras Facultad de Ciencias Médicas",
"Universidad Tecnológica Centroamericana (UNITEC) Facultad de Ciencias de la Salud",
"Semmelweis University Faculty of Medicine",
"University of Debrecen Faculty of Medicine",
"University of Pécs Medical School",
"University of Szeged Faculty of Medicine",
"University of Iceland Faculty of Medicine",
"A.C.S. Medical College and Hospital",
"A.C.S.R. Government Medical College",
"A.J. Institute of Medical Sciences and Research Centre",
"Aarupadai Veedu Medical College",
"Acharya Shri Chander College of Medical Sciences",
"Adesh Institute of Medical Sciences & Research",
"Adesh Medical College and Hospital, Shahabad",
"Adichunchanagiri Institute of Medical Sciences",
"Agartala Government Medical College",
"Ahmedabad Municipal Corporation Medical Education Trust Medical College",
"Akash Institute of Medical Sciences & Research Centre",
"Al-Ameen Medical College",
"Al-Azhar Medical College and Super Speciality Hospital",
"All India Institute of Medical Sciences, Bhopal",
"All India Institute of Medical Sciences, Bhubaneswar",
"All India Institute of Medical Sciences, Jodhpur",
"All India Institute of Medical Sciences, Nagpur",
"All India Institute of Medical Sciences, New Delhi",
"All India Institute of Medical Sciences, Patna",
"All India Institute of Medical Sciences, Raipur",
"All India Institute of Medical Sciences, Rishikesh",
"Alluri Sitaram Raju Academy of Medical Sciences",
"Amala Institute of Medical Sciences",
"Amaltas Institute of Medical Sciences",
"American International Institute of Medical Sciences",
"Amrita School of Medicine",
"Ananta Institute of Medical Sciences & Research Centre",
"Andaman & Nicobar Islands Institute of Medical Sciences",
"Andhra Medical College",
"Annapoorna Medical College and Hospital",
"Anugrah Narayan Magadh Medical College and Hospital",
"Apollo Institute of Medical Sciences and Research, Chittoor",
"Apollo Institute of Medical Sciences and Research, Hyderabad",
"Armed Forces Medical College",
"Army College of Medical Sciences",
"Ashwini Rural Medical College, Hospital and Research Centre",
"Assam Medical College",
"Azeezia Institute of Medical Science",
"B.G.S. Global Institute of Medical Sciences",
"B.J. Govt. Medical College, Pune",
"B.J. Medical College, Ahmedabad",
"B.K.L. Walawalkar Rural Medical College",
"B.P.S. Government Medical College for Women",
"Baba Raghav Das Medical College",
"Bangalore Medical College and Research Institute",
"Bankura Sammilani Medical College",
"Basaveshwara Medical College and Hospital",
"Belgaum Institute of Medical Sciences",
"Believers Church Medical College and Hospital",
"Bharat Ratna Late Shri Atal Bihari Vajpyee Memorial Medical College",
"Bharati Vidyapeeth Medical College and Hospital, Sangli",
"Bharati Vidyapeeth Medical College, Pune",
"Bhaskar Medical College",
"Bidar Institute of Medical Sciences",
"Bundelkhand Medical College",
"Burdwan Medical College",
"C.U. Shah Medical College",
"Calcutta National Medical College",
"Career Institute of Medical Sciences & Hospital",
"Chalmeda Anand Rao Institute of Medical Sciences",
"Chamarajanagar Institute of Medical Sciences",
"Chandulal Chandrakar Memorial Medical College",
"Chengalpattu Medical College",
"Chettinad Hospital & Research Institute",
"Chhattisgarh Institute of Medical Sciences",
"Chirayu Medical College and Hospital",
"Christian Medical College, Ludhiana",
"Christian Medical College, Vellore",
"Coimbatore Medical College",
"College of Medicine and J.N.M. Hospital",
"College of Medicine and Sagore Dutta Hospital",
"D.M. Wayanad Institute of Medical Sciences",
"D.Y. Patil Medical College, Kolhapur",
"D.Y. Patil University School of Medicine",
"Darbhanga Medical College and Hospital",
"Dayanand Medical College",
"Deccan College of Medical Sciences",
"Dhanalakshmi Srinivasan Medical College and Hospital, Perambalur",
"Dr. B.R. Ambedkar Medical College",
"Dr. Baba Saheb Ambedkar Medical College",
"Dr. D.Y. Patil Medical College, Hospital and Research Centre",
"Dr. M.K. Shah Medical College & Research Centre",
"Dr. Panjabrao Deshmukh Memorial Medical College",
"Dr. Pinnamaneni Siddhartha Institute of Medical Sciences",
"Dr. Radhakrishnan Government Medical College",
"Dr. Rajendra Prasad Government Medical College",
"Dr. Ram Manohar Lohia Institute of Medical Sciences",
"Dr. S.N. Medical College",
"Dr. Shankarrao Chavan Government Medical College, Nanded",
"Dr. Somervell Memorial CSI Hospital & Medical College",
"Dr. Ulhas Patil Medical College & Hospital",
"Dr. V.R.K. Women's Medical College",
"Dr. Vaishampayan Memorial Medical College",
"Dr. Yashwant Singh Parmar Government Medical College Nahan",
"E.S.I.C. Medical College & Postgraduate Institute of Medical Sciences and Research",
"East Point College of Medical Sciences",
"Employees' State Insurance Corporation Medical College, Bangalore",
"Employees' State Insurance Corporation Medical College, Faridabad",
"Employees' State Insurance Corporation Medical College, Gulbarga",
"Employees' State Insurance Corporation Medical College, Joka",
"Employees' State Insurance Corporation Medical College, Sanathnagar",
"Era's Lucknow Medical College",
"F.H. Medical College & Hospital",
"Fakhruddin Ali Ahmed Medical College and Hospital",
"Father Muller Medical College",
"Fathima Institute of Medical Sciences, Kadapa",
"G.C.S. Medical College, Hospital and Research Centre",
"G.M.E.R.S. Medical College and Hospital, Dharpur Patan",
"G.M.E.R.S. Medical College and Hospital, Gandhinagar",
"G.M.E.R.S. Medical College and Hospital, Himmatnagar",
"G.M.E.R.S. Medical College and Hospital, Sola",
"G.M.E.R.S. Medical College, Gotri",
"G.M.E.R.S. Medical College, Junagadh",
"G.M.E.R.S. Medical College, Vadnagar, Mehsana",
"G.M.E.R.S. Medical College, Valsad",
"G.S.L. Medical College, Rajahmundry",
"G.S.V.M. Medical College",
"Gadag Institute of Medical Sciences, Mallasamudra",
"Gajra Raja Medical College",
"Gandhi Medical College and Hospital, Secunderabad",
"Gandhi Medical College, Bhopal",
"Gauhati Medical College",
"Gayatri Vidya Parishad Institute of Health Care & Medical Technology",
"Geetanjali Medical College and Hospital",
"Gian Sagar Medical College",
"GITAM Institute of Medical Sciences and Research",
"Goa Medical College",
"Government Dharmapuri Medical College",
"Government Doon Medical College",
"Government Kilpauk Medical College",
"Government Medical College & ESIC Hospital, Coimbatore",
"Government Medical College & Super Facility Hospital Azamgarh",
"Government Medical College Akola",
"Government Medical College Amritsar",
"Government Medical College Anantapuramu",
"Government Medical College Aurangabad",
"Government Medical College Bettiah",
"Government Medical College Bhavnagar",
"Government Medical College Chandigarh",
"Government Medical College Chandrapur",
"Government Medical College Ernakulam",
"Government Medical College Gondia",
"Government Medical College Haldwani",
"Government Medical College Jammu",
"Government Medical College Kannauj",
"Government Medical College Kota",
"Government Medical College Kottayam",
"Government Medical College Kozhikode",
"Government Medical College Latur",
"Government Medical College Mahabubnagar",
"Government Medical College Manjeri",
"Government Medical College Miraj",
"Government Medical College Nagpur",
"Government Medical College Nizamabad",
"Government Medical College Omandurar",
"Government Medical College Palakkad",
"Government Medical College Parippally, Kollam",
"Government Medical College Patiala",
"Government Medical College Pudukottai",
"Government Medical College Ratlam",
"Government Medical College Srinagar",
"Government Medical College Surat",
"Government Medical College Thrissur",
"Government Medical College Vellore",
"Government Medical College, Kannur",
"Government Sivagangai Medical College",
"Government Thiruvannamalai Medical College",
"Government Thiruvarur Medical College and Hospital",
"Government Villupuram Medical College",
"Grant Government Medical College, Mumbai",
"Great Eastern Medical School and Hospital",
"Gujarat Adani Institute of Medical Sciences",
"Gulbarga Institute of Medical Sciences",
"Guntur Medical College",
"Guru Gobind Singh Medical College",
"H.B.T. Medical College & Dr. R.N. Cooper Municipal General Hospital",
"Hamdard Institute of Medical Sciences & Research, New Delhi",
"Hassan Institute of Medical Sciences",
"Heritage Institute of Medical Sciences, Varanasi",
"Hi-Tech Medical College and Hospital, Bhubaneswar",
"Hi-Tech Medical College and Hospital, Rourkela",
"Himalayan Institute of Medical Sciences",
"Hind Institute of Medical Sciences, Lucknow",
"Hind Institute of Medical Sciences, Sitapur",
"I.R.T. Perundurai Medical College and Research Centre",
"ICARE Institute of Medical Science and Research",
"Index Medical College & Research Centre",
"Indian Institute of Medical Science & Research",
"Indira Gandhi Government Medical College, Nagpur",
"Indira Gandhi Institute of Medical Sciences",
"Indira Gandhi Medical College and Research Institute",
"Indira Gandhi Medical College, Shimla",
"Institute of Medical Science and Research, Vidyagiri",
"Institute of Medical Sciences & SUM Hospital",
"Institute of Medical Sciences, Varanasi",
"Institute of Postgraduate Medical Education & Research, Kolkata",
"Integral Institute of Medical Sciences & Research",
"IQ City Medical College",
"J.J.M. Medical College, Davangere",
"J.S.S. Medical College",
"Jaipur National University Institute for Medical Sciences and Research Centre",
"Jawaharlal Institute of Post-Graduate Medical Education and Research (JIPMER)",
"Jawaharlal Nehru Institute of Medical Sciences, Porompat",
"Jawaharlal Nehru Medical College, Ajmer",
"Jawaharlal Nehru Medical College, Aligarh",
"Jawaharlal Nehru Medical College, Belgaum",
"Jawaharlal Nehru Medical College, Bhagalpur",
"Jawaharlal Nehru Medical College, Wardha",
"Jhalawar Medical College",
"JMF's A.C.P.M. Medical College",
"Jorhat Medical College and Hospital",
"Jubilee Mission Medical College and Research Institute",
"K.A.P. Viswanatham Government Medical College",
"K.D. Medical College Hospital & Research Centre",
"K.J. Somaiya Medical College",
"K.M.C.T. Medical College",
"K.P.C. Medical College and Hospital",
"K.S. Hegde Medical Academy",
"K.V.G. Medical College",
"Kakatiya Medical College",
"Kalinga Institute of Medical Sciences",
"Kalpana Chawla Government Medical College, Karnal",
"Kamineni Academy of Medical Sciences & Research Center",
"Kamineni Institute of Medical Sciences",
"Kanachur Institute of Medical Sciences",
"Kannur Medical College",
"Kanyakumari Government Medical College",
"Karnataka Institute of Medical Sciences",
"Karpaga Vinayaga Institute of Medical Sciences",
"Karpagam Faculty of Medical Sciences and Research",
"Karuna Medical College",
"Karwar Institute of Medical Sciences",
"Kasturba Medical College Mangalore",
"Kasturba Medical College Manipal",
"Katihar Medical College",
"Katuri Medical College, Guntur",
"Kempegowda Institute of Medical Sciences",
"Khaja Bandanawaz University Faculty of Medical Sciences",
"King George's Medical University",
"Kodagu Institute of Medical Sciences",
"Kolkata Medical College & Hospital",
"Konaseema Institute of Medical Sciences & Research Foundation",
"Koppal Institute of Medical Sciences",
"Krishna Institute of Medical Sciences University Faculty of Medical Sciences",
"Krishna Mohan Medical College and Hospital",
"Kurnool Medical College",
"L.N. Medical College and Research Centre",
"Lady Hardinge Medical College",
"Lala Lajpat Rai Memorial Medical College",
"Late Baliram Kashyap Memorial Government Medical College",
"Late Shri Lakhi Ram Agrawal Memorial Government Medical College",
"Lokmanya Tilak Municipal Medical College",
"M.E.S. Medical College",
"M.N.R. Medical College",
"M.P. Shah Government Medical College",
"M.S. Ramaiah Medical College",
"M.V.J. Medical College and Research Hospital",
"M.V.P. Samaj's Dr. Vasantrao Pawar Medical College Hospital & Research Centre",
"Madha Medical College and Research Institute",
"Madras Medical College",
"Madurai Medical College",
"Mahadevappa Rampure Medical College",
"Mahamaya Rajkiya Allopathic Medical College",
"Maharaja Agrasen Medical College",
"Maharaja Krishna Chandra Gajapati Medical College",
"Maharajah's Institute of Medical Sciences, Vizianagaram",
"Maharani Laxmi Bai Medical College",
"Maharashtra Institute of Medical Education & Research (MIMER)",
"Maharashtra Institute of Medical Sciences & Research (MIMSR)",
"Maharishi Markandeshwar Institute of Medical Sciences & Research",
"Maharishi Markandeshwar Medical College & Hospital, Solan",
"Mahatma Gandhi Institute of Medical Sciences, Wardha",
"Mahatma Gandhi Medical College and Hospital, Jaipur",
"Mahatma Gandhi Medical College and Research Institute",
"Mahatma Gandhi Memorial Medical College, Indore",
"Mahatma Gandhi Memorial Medical College, Jamshedpur",
"Mahatma Gandhi Mission's Medical College, Aurangabad",
"Mahatma Gandhi Mission's Medical College, Navi Mumbai",
"Mahavir Institute of Medical Sciences",
"Maheshwara Medical College",
"Major S.D. Singh Medical College and Hospital",
"Malabar Medical College",
"Malankara Orthodox Syrian Church Medical College",
"Malda Medical College and Hospital",
"Malla Reddy Institute of Medical Sciences",
"Mallareddy Medical College for Women",
"Mamata Medical College",
"Mandya Institute of Medical Sciences",
"Manyavar Kanshi Ram Ji Government Allopathic Medical College",
"Mata Gujri Memorial Medical College",
"Maulana Azad Medical College",
"Mayo Institute of Medical Sciences",
"Medical College Baroda",
"Medical College Thiruvananthapuram",
"MediCiti Institute of Medical Sciences",
"Meenakshi Medical College Hospital and Research Institute",
"Melmaruvathur Adhiparasakthi Institute of Medical Sciences & Research",
"Midnapore Medical College",
"Mohan Kumaramangalam Medical College",
"Moti Lal Nehru Medical College, Allahabad",
"Mount Zion Medical College",
"Murshidabad Medical College and Hospital",
"Muzaffarnagar Medical College",
"Mysore Medical College and Research Institute",
"N.C. Medical College & Hospital",
"N.K.P. Salve Institute of Medical Sciences",
"N.R.I. Institute of Medical Sciences, Visakhapatnam",
"N.R.I. Medical College, Guntur",
"Nalanda Medical College",
"Narayan Medical College and Hospital",
"Narayana Medical College",
"National Institute of Medical Sciences and Research Medical College and Hospital",
"Navodaya Medical College",
"Netaji Subhash Chandra Bose Medical College",
"Nilratan Sircar Medical College",
"Nimra Institute of Medical Sciences",
"North Bengal Medical College",
"North Delhi Municipal Corporation Medical College",
"North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences",
"Osmania Medical College",
"P.E.S. Institute of Medical Sciences and Research",
"P.K. Das Institute of Medical Sciences",
"P.S.G. Institute of Medical Sciences and Research",
"Pacific Institute of Medical Sciences",
"Pacific Medical College & Hospital",
"Padmashri Dr. Vithalrao Vikhe Patil Foundation's Medical College",
"Pandit Deendayal Upadhyay Medical College, Rajkot",
"Pandit Jawahar Lal Nehru Medical College and Hospital",
"Pandit Raghunath Murmu Medical College and Hospital",
"Parul Institute of Medical Sciences & Research",
"Patliputra Medical College",
"Patna Medical College",
"People's College of Medical Sciences & Research Centre",
"Pondicherry Institute of Medical Sciences and Research",
"Prakash Institute of Medical Sciences & Research, Urun-Islampur",
"Pramukhswami Medical College",
"Prasad Institute of Medical Sciences",
"Prathima Institute of Medical Sciences",
"Pt. B.D.S. Postgraduate Institute of Medical Sciences",
"Pt. Jawahar Lal Nehru Memorial Medical College Raipur",
"Punjab Institute of Medical Sciences",
"Pushpagiri Institute of Medical Sciences and Research Centre",
"R.G. Kar Medical College",
"R.K.D.F. Medical College Hospital & Research Centre, Jatkhedi",
"R.U.H.S. College of Medical Sciences",
"R.V.M. Institute of Medical Sciences and Research Center",
"Raichur Institute of Medical Sciences",
"Raipur Institute of Medical Sciences",
"Rajah Muthiah Medical College",
"Rajarajeswari Medical College & Hospital",
"Rajarshi Chhatrapati Shahu Maharaj Government Medical College Kolhapur",
"Rajendra Institute of Medical Sciences, Ranchi",
"Rajiv Gandhi Institute of Medical Sciences, Adilabad",
"Rajiv Gandhi Institute of Medical Sciences, Kadapa",
"Rajiv Gandhi Institute of Medical Sciences, Ongole",
"Rajiv Gandhi Institute of Medical Sciences, Srikakulam",
"Rajiv Gandhi Medical College and Chhatrapati Shivaji Maharaj Hospital",
"Rajshree Medical Research Institute",
"Rama Medical College and Hospital, Hapur",
"Rama Medical College and Hospital, Kanpur",
"Rangaraya Medical College",
"Ravindra Nath Tagore Medical College",
"Regional Institute of Medical Sciences",
"Rohilkhand Medical College & Hospital",
"Rural Medical College of Pravara Medical Trust",
"Ruxmaniben Deepchand Gardi Medical College",
"S. Nijalingappa Medical College and H.S.K. Hospital & Research Centre",
"S.D.M. Medical College",
"S.G.T. Medical College, Hospital and Research Institute",
"S.M.B.T. Institute of Medical Sciences & Research Centre",
"S.R.M. Medical College Hospital and Research Centre",
"S.S. Institute of Medical Sciences & Research Centre, Davangere",
"S.V.S. Medical College",
"Saheed Laxman Nayak Medical College and Hospital",
"Santhiram Medical College",
"Santosh Medical College",
"Sapthagiri Institute of Medical Sciences & Research Centre",
"Saraswathi Institute of Medical Sciences",
"Saraswati Medical College",
"Sardar Patel Medical College",
"Sarojini Naidu Medical College",
"Saveetha Medical College and Hospital",
"Sawai Man Singh Medical College",
"School of Medical Sciences and Research, Greater Noida",
"Seth G.S. Medical College",
"Shadan Institute of Medical Sciences Teaching Hospital & Research Centre",
"Shaheed Hasan Khan Mewati Government Medical College",
"Shaikh-Ul-Hind Maulana Mahmood Hasan Medical College",
"Sher-i-Kashmir Institute of Medical Sciences (SKIMS)",
"Shimoga Institute of Medical Sciences",
"Shri B.M. Patil Medical College Hospital & Research Centre, B.L.D.E. University",
"Shri Bhausaheb Hire Government Medical College",
"Shri Guru Ram Rai Institute of Medical & Health Sciences",
"Shri Lal Bahadur Shastri Government Medical College",
"Shri Ram Murti Smarak Institute of Medical Sciences",
"Shri Sathya Sai Medical College and Research Institute",
"Shri Shankaracharya Institute of Medical Sciences",
"Shri Vasantrao Naik Government Medical College",
"Shridevi Institute of Medical Sciences & Research Hospital",
"Shyam Shah Medical College",
"Siddhartha Medical College",
"Sikkim Manipal Institute of Medical Sciences, Sikkim Manipal University",
"Silchar Medical College",
"Smt. B.K. Shah Medical Institute and Research Centre",
"Smt. Kashibai Navale Medical College and Hospital",
"Smt. N.H.L. Municipal Medical College",
"Sree Balaji Medical College and Hospital",
"Sree Gokulam Medical College & Research Foundation",
"Sree Mookambika Institute of Medical Sciences",
"Sree Narayana Institute of Medical Sciences",
"Sree Uthradom Thirunal Academy of Medical Sciences",
"Sri Aurobindo Institute of Medical Sciences",
"Sri Devaraj Urs Medical College",
"Sri Guru Ram Das Institute of Medical Sciences & Research",
"Sri Krishna Medical College",
"Sri Lakshmi Narayana Institute of Medical Sciences",
"Sri Manakula Vinayagar Medical College & Hospital",
"Sri Muthukumaran Medical College Hospital and Research Institute",
"Sri Padmavathi Medical College for Women",
"Sri Ramachandra Institute of Higher Education and Research (Deemed University)",
"Sri Siddhartha Medical College",
"Sri Venkateshwaraa Medical College Hospital & Research Centre",
"Sri Venkateswara Medical College",
"Srinivas Institute of Medical Sciences and Research Centre",
"Sriram Chandra Bhanja Medical College",
"St. John's Medical College",
"Stanley Medical College",
"Subbaiah Institute of Medical Sciences",
"Surat Municipal Institute of Medical Education and Research",
"Swami Ramanand Teerth Rural Medical College",
"T.D. Medical College",
"T.S. Misra Medical College & Hospital",
"Tagore Medical College and Hospital",
"Teerthankar Mahaveer Medical College",
"Terna Medical College",
"Tezpur Medical College & Hospital",
"Thanjavur Medical College",
"The Oxford Medical College, Hospital & Research Centre",
"Theni Government Medical College",
"Thoothukudi Medical College",
"Tirunelveli Medical College",
"Topiwala National Medical College",
"Travancore Medical College",
"Trichy SRM Medical College Hospital and Research Centre",
"Tripura Medical College & Dr. B. R. Ambedkar Memorial Teaching Hospital",
"University College of Medical Sciences and Guru Teg Bahadur Hospital",
"Uttar Pradesh University of Medical Sciences",
"Vardhman Institute of Medical Sciences",
"Vardhman Mahavir Medical College & Safdarjung Hospital",
"Vedantaa Institute of Medical Sciences",
"Veer Chandra Singh Garhwali Government Institute of Medical Science & Research",
"Veer Surendra Sai Institute of Medical Sciences and Research",
"Velammal Medical College Hospital and Research Institute",
"Vijayanagar Institute of Medical Sciences",
"Vinayaka Mission's Kirupananda Variyar Medical College, Salem",
"Vinayaka Mission's Medical College, Karaikal",
"Viswabharathi Medical College",
"Vydehi Institute of Medical Sciences & Research Centre, Bangalore",
"Yenepoya Medical College",
"Jakarta Christian University (UKRIDA) Faculty of Medicine",
"Universitas Abdurrab Fakultas Kedokteran dan Ilmu Kesehatan",
"Universitas Abulyatama Fakultas Kedokteran",
"Universitas Airlangga Fakultas Kedokteran",
"Universitas Alkhairaat Fakultas Kedokteran",
"Universitas Andalas Fakultas Kedokteran",
"Universitas Baiturrahmah Fakultas Kedokteran",
"Universitas Batam Fakultas Kedokteran dan Ilmu Kesehatan",
"Universitas Bengkulu Fakultas Kedokteran dan Ilmu Kesehatan",
"Universitas Brawijaya Fakultas Kedokteran",
"Universitas Cenderawasih Fakultas Kedokteran",
"Universitas Diponegoro Fakultas Kedokteran",
"Universitas Gadjah Mada Sekip Fakultas Kedokteran, Kesehatan Masyarakat dan Keperawatan",
"Universitas Haluoleo Fakultas Kedokteran",
"Universitas Hang Tuah Fakultas Kedokteran",
"Universitas Hasanuddin Fakultas Kedokteran",
"Universitas Indonesia Fakultas Kedokteran",
"Universitas Islam Al-Azhar Fakultas Kedokteran",
"Universitas Islam Bandung Fakultas Kedokteran",
"Universitas Islam Indonesia Fakultas Kedokteran",
"Universitas Islam Malang Fakultas Kedokteran",
"Universitas Islam Negeri Syarif Hidayatullah Fakultas Kedokteran",
"Universitas Islam Sultan Agung (UNISSULA) Fakultas Kedokteran",
"Universitas Islam Sumatra Utara Fakultas Kedokteran",
"Universitas Jambi Fakultas Kedokteran",
"Universitas Jember Fakultas Kedokteran",
"Universitas Jenderal Ahmad Yani Fakultas Kedokteran",
"Universitas Jenderal Soedirman Fakultas Kedokteran dan Ilmu-Ilmu Kesehatan",
"Universitas Katolik Indonesia Atma Jaya Fakultas Kedokteran",
"Universitas Katolik Widya Mandala Fakultas Kedokteran",
"Universitas Kristen Duta Wacana Fakultas Kedokteran",
"Universitas Kristen Indonesia Fakultas Kedokteran",
"Universitas Kristen Maranatha Fakultas Kedokteran",
"Universitas Lambung Mangkurat Fakultas Kedokteran",
"Universitas Lampung Fakultas Kedokteran",
"Universitas Malahayati Fakultas Kedokteran",
"Universitas Malikussaleh Fakultas Kedokteran",
"Universitas Mataram Fakultas Kedokteran",
"Universitas Methodist Indonesia Faculty of Medicine",
"Universitas Muhammadiyah Jakarta Fakultas Kedokteran dan Kesehatan",
"Universitas Muhammadiyah Makassar Fakultas Kedokteran",
"Universitas Muhammadiyah Malang Fakultas Kedokteran",
"Universitas Muhammadiyah Palembang Fakultas Kedokteran",
"Universitas Muhammadiyah Purwokerto Fakultas Kedokteran",
"Universitas Muhammadiyah Semarang Fakultas Kedokteran",
"Universitas Muhammadiyah Sumatera Utara Fakultas Kedokteran",
"Universitas Muhammadiyah Surakarta Fakultas Ilmu Kedokteran",
"Universitas Muhammadiyah Yogyakarta Fakultas Kedokteran",
"Universitas Mulawarman Fakultas Kedokteran",
"Universitas Muslim Indonesia Fakultas Kedokteran",
"Universitas Nahdlatul Ulama Fakultas Kedokteran",
"Universitas Nusa Cendana Fakultas Kedokteran",
"Universitas Padjadjaran Fakultas Kedokteran",
"Universitas Palangka Raya Fakultas Kedokteran",
"Universitas Papua Fakultas Kedokteran",
"Universitas Pattimura Fakultas Kedokteran",
"Universitas Pelita Harapan Fakultas Kedokteran",
"Universitas Pembangunan Nasional Veteran Fakultas Kedokteran",
"Universitas Prima Indonesia Fakultas Kedokteran",
"Universitas Riau Fakultas Kedokteran",
"Universitas Sam Ratulangi Fakultas Kedokteran",
"Universitas Sebelas Maret Fakultas Kedokteran",
"Universitas Sriwijaya Fakultas Kedokteran",
"Universitas Sumatera Utara Fakultas Kedokteran",
"Universitas Swadaya Gunung Jati Fakultas Kedokteran",
"Universitas Syiah Kuala Fakultas Kedokteran",
"Universitas Tadulako Fakultas Kedokteran dan Ilmu Kesehatan",
"Universitas Tanjungpura Fakultas Kedokteran",
"Universitas Tarumanagara Fakultas Kedokteran",
"Universitas Trisakti Fakultas Kedokteran",
"Universitas Udayana Fakultas Kedokteran",
"Universitas Warmadewa Fakultas Kedokteran",
"Universitas Wijayakusuma Fakultas Kedokteran",
"Universitas Yarsi Fakultas Kedokteran",
"Abadan University of Medical Sciences Medical School",
"Ahvaz Jondishapour University of Medical Sciences",
"Alborz University of Medical Sciences School of Medicine",
"Arak University of Medical Sciences School of Medicine",
"Ardabil University of Medical Sciences Faculty of Medicine",
"Army University of Medical Sciences Medical School",
"Babol University of Medical Sciences Faculty of Medicine",
"Bam University of Medical Sciences and Health Services",
"Baqiyatallah University of Medical Sciences Faculty of Medicine",
"Birjand University of Medical Sciences and Health Services Medical School",
"Bushehr University of Medical Sciences and Health Services",
"Dezful University of Medical Sciences and Health Services",
"Fasa University of Medical Sciences Faculty of Medicine",
"Golestan University of Medical Sciences Medical School",
"Gonabad University of Medical Sciences School of Medicine",
"Guilan University of Medical Sciences",
"Hamadan University of Medical Sciences Medical School",
"Hormozgan University of Medical Sciences (HUMS) Faculty of Medicine",
"Ilam University of Medical Sciences School of Medicine",
"Iran University of Medical Sciences (IUMS) School of Medicine",
"Iranshahr University of Medical Sciences and Health Services School of Medicine",
"Isfahan University of Medical Sciences Faculty of Medicine",
"Islamic Azad University Ardabil Branch Faculty of Medicine",
"Islamic Azad University Kazeroon Branch Faculty of Medicine",
"Islamic Azad University Kerman Branch Faculty of Medicine",
"Islamic Azad University Mashhad Branch Faculty of Medicine",
"Islamic Azad University Najafabad Branch Faculty of Medical Science",
"Islamic Azad University Qeshm Branch Faculty of Medicine",
"Islamic Azad University Sari Branch Faculty of Medicine",
"Islamic Azad University Shahrood Branch Faculty of Medicine",
"Islamic Azad University Tabriz Branch Faculty of Medicine",
"Islamic Azad University Tehran Faculty of Medicine",
"Islamic Azad University Tonekabon Branch Faculty of Medicine",
"Islamic Azad University Yazd Ali ibn Abitaleb Medical School",
"Islamic Azad University Zahedan Branch Faculty of Medicine",
"Jahrom University of Medical Sciences Faculty of Medicine",
"Jiroft University of Medical Sciences Medical School",
"Kashan University of Medical Sciences and Health Services Faculty of Medicine",
"Kerman University of Medical Sciences Faculty of Medicine",
"Kermanshah University of Medical Sciences School of Medicine",
"Kurdistan University of Medical Sciences School of Medicine",
"Lorestan University of Medical Sciences School of Medicine",
"Mashhad University of Medical Sciences Faculty of Medicine",
"Mazandaran University of Medical Sciences Faculty of Medicine",
"North Khorasan University of Medical Sciences Faculty of Medicine",
"Qazvin University of Medical Sciences Shahid Babaei Faculty of Medicine",
"Qom Islamic Azad University Medicine College",
"Qom University of Medical Sciences Faculty of Medicine",
"Rafsanjan University of Medical Sciences School of Medicine",
"Sabzevar Faculty of Medical Sciences School of Medicine",
"Semnan University of Medical Sciences Faculty of Medicine",
"Shahed University Faculty of Medicine",
"Shahid Beheshti University of Medical Sciences Faculty of Medicine",
"Shahid Sadooghi University of Medical Sciences College of Medicine",
"Shahrekord University of Medical Sciences Faculty of Medicine",
"Shahroud University of Medical Sciences Faculty of Medicine",
"Shiraz University of Medical Sciences School of Medicine",
"Tabriz University of Medical Sciences Faculty of Medicine",
"Tehran University of Medical Sciences School of Medicine",
"Urmia University of Medical Sciences Faculty of Medicine",
"Yasuj University of Medical Sciences Faculty of Medicine",
"Zabol University of Medical Sciences Faculty of Medicine",
"Zahedan University of Medical Sciences Faculty of Medicine",
"Zanjan University of Medical Sciences Faculty of Medicine",
"Al Muthanna University College of Medicine",
"Al-Iraqia University College of Medicine",
"Al-Kindy College of Medicine",
"Al-Nahrain University College of Medicine",
"Al-Qadisiya University College of Medicine",
"Babylon University College of Medicine",
"Hawler Medical University College of Medicine",
"Ibn Sina University of Medical and Pharmaceutical Sciences College of Medicine",
"Jabir ibn Hayyan Medical University",
"Koya University School of Medicine",
"Kufa University College of Medicine",
"Ninevah College of Medicine",
"Thi-Qar University College of Medicine",
"University of Al-Ameed College of Medicine",
"University of Al-Mustansiriyah College of Medicine",
"University of Anbar College of Medicine",
"University of Baghdad College of Medicine",
"University of Basrah College of Medicine",
"University of Diyala College of Medicine",
"University of Duhok College of Medicine",
"University of Fallujah College of Medicine",
"University of Kerbala College of Medicine",
"University of Kirkuk College of Medicine",
"University of Kurdistan Hewlêr School of Medicine",
"University of Misan Faculty of Medicine",
"University of Mosul College of Medicine",
"University of Sulaimani College of Medicine",
"University of Tikrit College of Medicine",
"University of Wasit College of Medicine",
"NUI Galway School of Medicine",
"Royal College of Surgeons in Ireland School of Medicine",
"Trinity College Dublin School of Medicine",
"University College Cork School of Medicine",
"University College Dublin School of Medicine",
"University of Limerick School of Medicine",
"Bar-Ilan University Faculty of Medicine in the Galilee",
"Ben-Gurion University of the Negev Faculty of Health Sciences",
"Ruth and Bruce Rappaport Faculty of Medicine, Technion Israel Institute of Technology",
"Sackler School of Medicine, Tel Aviv University",
"The Hebrew University-Hadassah Medical School",
"Humanitas University Medical School",
"Saint Camillus International University of Health Sciences",
"Università Campus Bio-Medico di Roma Facoltà di Medicina e Chirurgia",
"Università Cattolica del Sacro Cuore Facoltà di Medicina e Chirurgia 'Agostino Gemelli'",
"Università degli Studi del Molise Facoltà di Medicina e Chirurgia",
"Università degli Studi del Piemonte Orientale Facoltà di Medicina Chirurgia e Scienze della Salute",
"Università degli Studi dell'Aquila Facoltà di Medicina e Chirurgia",
"Università degli Studi dell'Insubria Facoltà di Medicina e Chirurgia",
"Università degli Studi della Campania Luigi Vanvitelli Scuola di Medicina e Chirurgia",
"Università degli Studi di Bari Aldo Moro Facoltà di Medicina e Chirurgia",
"Università degli Studi di Bologna Scuola di Medicina e Chirurgia",
"Università degli Studi di Brescia Facoltà di Medicina e Chirurgia",
"Università degli Studi di Cagliari Facoltà di Medicina e Chirurgia",
"Università degli Studi di Catania Facoltà di Medicina e Chirurgia",
"Università degli Studi di Ferrara Facoltà di Medicina e Chirurgia",
"Università degli Studi di Firenze Scuola di Scienze della Salute Umana",
"Università degli Studi di Foggia Facoltà di Medicina e Chirurgia",
"Università degli Studi di Genova Scuola di Scienze Mediche e Farmaceutiche",
"Università degli Studi di Messina",
"Università degli Studi di Milano Bicocca Facoltà di Medicina e Chirurgia",
"Università degli Studi di Milano Facoltà di Medicina e Chirurgia",
"Università degli Studi di Modena e Reggio Emilia Facoltà di Medicina e Chirurgia",
"Università degli Studi di Napoli Federico II Scuola di Medicina e Chirurgia",
"Università degli Studi di Padova Scuola di Medicina e Chirurgia",
"Università degli Studi di Palermo Scuola di Medicina e Chirurgia",
"Università degli Studi di Parma Facoltà di Medicina e Chirurgia",
"Università degli Studi di Pavia Facoltà di Medicina e Chirurgia",
"Università degli Studi di Perugia Facoltà di Medicina e Chirurgia",
"Università degli Studi di Roma 'La Sapienza' Facoltà di Farmacia e Medicina",
"Università degli Studi di Roma 'La Sapienza' Facoltà di Medicina e Odontoiatria",
"Università degli Studi di Roma 'La Sapienza' Facoltà di Medicina e Psicologia",
"Università degli Studi di Roma 'Tor Vergata' Facoltà di Medicina e Chirurgia",
"Università degli Studi di Salerno Facoltà di Medicina e Chirurgia",
"Università degli Studi di Sassari Facoltà di Medicina e Chirurgia",
"Università degli Studi di Siena Facoltà di Medicina e Chirurgia",
"Università degli Studi di Torino Scuola di Medicina",
"Università degli Studi di Trieste Facoltà di Medicina e Chirurgia",
"Università degli Studi di Udine Facoltà di Medicina e Chirurgia",
"Università degli Studi di Verona Facoltà di Medicina e Chirurgia",
"Università degli Studi G. d'Annunzio Chieti-Pescara Scuola di Medicina e Scienze della Salute",
"Università degli Studi Magna Græcia di Catanzaro Scuola di Medicina e Chirurgia",
"Università di Pisa Facoltà di Medicina e Chirurgia",
"Università Politecnica delle Marche Facoltà di Medicina e Chirurgia",
"Università Vita-Salute San Raffaele Facoltà di Medicina e Chirurgia",
"All American Institute of Medical Sciences",
"Caribbean School of Medical Sciences",
"University of the West Indies Faculty of Medical Sciences, Jamaica",
"Aichi Medical University",
"Akita University School of Medicine",
"Asahikawa Medical University",
"Chiba University School of Medicine",
"Dokkyo Medical University",
"Ehime University School of Medicine",
"Fujita Health University School of Medicine",
"Fukuoka University School of Medicine",
"Fukushima Medical University School of Medicine",
"Gifu University School of Medicine",
"Gunma University Faculty of Medicine",
"Hamamatsu University School of Medicine",
"Hirosaki University School of Medicine",
"Hiroshima University Faculty of Medicine",
"Hokkaido University School of Medicine",
"Hyogo College of Medicine",
"International University of Health and Welfare (IUHW) School of Medicine",
"Iwate Medical University School of Medicine",
"Jichi Medical University School of Medicine",
"Jikei University School of Medicine",
"Juntendo University School of Medicine",
"Kagawa University Faculty of Medicine",
"Kagoshima University Faculty of Medicine",
"Kanazawa Medical University School of Medicine",
"Kanazawa University School of Medicine",
"Kansai Medical University School of Medicine",
"Kawasaki Medical School",
"Keio University School of Medicine",
"Kindai University School of Medicine",
"Kitasato University School of Medicine",
"Kobe University School of Medicine",
"Kochi Medical School",
"Kumamoto University School of Medicine",
"Kurume University School of Medicine",
"Kyorin University School of Medicine",
"Kyoto Prefectural University of Medicine",
"Kyoto University Faculty of Medicine",
"Kyushu University Faculty of Medicine",
"Mie University School of Medicine",
"Nagasaki University School of Medicine",
"Nagoya City University Medical School",
"Nagoya University School of Medicine",
"Nara Medical University Faculty of Medicine",
"National Defense Medical College",
"Nihon University School of Medicine",
"Niigata University School of Medicine",
"Nippon Medical School",
"Oita University Faculty of Medicine",
"Okayama University School of Medicine",
"Osaka City University Medical School",
"Osaka Medical College",
"Osaka University School of Medicine",
"Saga University Faculty of Medicine",
"Saitama Medical University Faculty of Medicine",
"Sapporo Medical University School of Medicine",
"Shiga University of Medical Science",
"Shimane University Faculty of Medicine",
"Shinshu University Faculty of Medicine",
"Showa University School of Medicine",
"St. Marianna University School of Medicine",
"Teikyo University School of Medicine",
"Toho University Faculty of Medicine",
"Tohoku Medical and Pharmaceutical University School of Medicine",
"Tohoku University School of Medicine",
"Tokai University School of Medicine",
"Tokushima University School of Medicine",
"Tokyo Medical and Dental University Faculty of Medicine",
"Tokyo Medical University",
"Tokyo Women's Medical University School of Medicine",
"Tottori University Faculty of Medicine",
"University of Fukui Faculty of Medical Sciences",
"University of Miyazaki Faculty of Medicine",
"University of Occupational & Environmental Health School of Medicine",
"University of the Ryukyus Faculty of Medicine",
"University of Tokyo Faculty of Medicine",
"University of Toyama School of Medicine",
"University of Tsukuba School of Medicine",
"University of Yamanashi Faculty of Medicine",
"Wakayama Medical University School of Medicine",
"Yamagata University School of Medicine",
"Yamaguchi University Faculty of Medicine and Health Sciences",
"Yokohama City University School of Medicine",
"Al-Balqa Applied University Faculty of Medicine",
"Hashemite University Faculty of Medicine",
"Jordan University of Science and Technology Faculty of Medicine",
"Mu'tah University Faculty of Medicine",
"University of Jordan Faculty of Medicine",
"Yarmouk University Faculty of Medicine",
"Al-Farabi Kazakh National University Faculty of Medicine and Health Care",
"Caspian University International School of Medicine",
"International Kazakh-Turkish University named after Khoja Ahmet Yassawi Faculty of Medicine",
"International Medical School, University of International Business",
"JSC National Medical University",
"Karaganda Medical University",
"Kazakh Medical University of Continuing Education Medical College",
"Kazakh-Russian Medical University",
"Nazarbayev University School of Medicine",
"NJSC Astana Medical University",
"Shukan Ualikhanov Kokshetau State University Faculty of Medicine",
"South Kazakhstan State Pharmaceutical Academy",
"State Medical University Semey",
"West Kazakhstan State Medical University named after Marat Ospanov",
"Egerton University Faculty of Health Sciences",
"Jomo Kenyatta University of Agriculture and Technology School of Medicine",
"Kenya Methodist University School of Medicine and Health Sciences",
"Kenyatta University School of Medicine",
"Maseno University School of Medicine",
"Moi University School of Medicine",
"University of Nairobi School of Medicine",
"Chongjin Medical University",
"Haeju Medical University",
"Hamhung Medical University",
"Hyesan Medical University",
"Kanggye Medical University",
"Pyongsong Medical University",
"Pyongyang Medical University",
"Sariwon Medical University",
"Sinuiju Medical University",
"Wonsan Medical University",
"Ajou University School of Medicine",
"Catholic Kwandong University College of Medicine",
"Catholic University of Daegu School of Medicine",
"Catholic University of Korea College of Medicine",
"Cha University School of Medicine",
"Chonnam National University College of Medicine",
"Chosun University College of Medicine",
"Chung-Ang University College of Medicine",
"Chungbuk National University College of Medicine",
"Chungnam National University College of Medicine",
"Dankook University College of Medicine",
"Dong-A University College of Medicine",
"Dongguk University School of Medicine",
"Eulji University College of Medicine",
"Ewha Womans University School of Medicine",
"Gachon University School of Medicine",
"Gyeongsang National University College of Medicine",
"Hallym University College of Medicine",
"Hanyang University College of Medicine",
"Inha University College of Medicine",
"Inje University College of Medicine",
"Jeju National University School of Medicine",
"Jeonbuk National University College of Medicine",
"Kangwon National University School of Medicine",
"Keimyung University College of Medicine",
"Konkuk University College of Medicine",
"Konyang University College of Medicine",
"Korea University College of Medicine",
"Kosin University College of Medicine",
"Kyung Hee University College of Medicine",
"Kyungpook National University School of Medicine",
"Pusan National University School of Medicine",
"Seoul National University College of Medicine",
"Soon Chun Hyang University College of Medicine",
"Sungkyunkwan University School of Medicine & Graduate School of Medicine",
"University of Ulsan College of Medicine",
"Wonkwang University College of Medicine",
"Yeungnam University College of Medicine",
"Yonsei University College of Medicine",
"Yonsei University Wonju College of Medicine",
"Kuwait University Faculty of Medicine",
"ABC Academy",
"Adam University School of Medicine",
"Ala-Too International University",
"Avicenna International Medical University",
"Eurasian International Medical University Faculty of Medicine",
"I.K. Akhunbaev Kyrgyz State Medical Academy Faculty of General Medicine",
"International Higher School of Medicine",
"International Medical University",
"International School of Medicine, International University of Kyrgyzstan Eastern Medical Campus",
"Jalal-Abad State University Medical Faculty",
"Kyrgyz National University named after Jusup Balasagyn",
"Kyrgyz-Russian Slavic State University (KRSU) Medical Faculty",
"Kyrgyz-Uzbek University Medical Faculty",
"Osh International Medical University",
"Osh State University Medical Faculty",
"Royal Metropolitan University",
"S. Tentishev Asian Medical Institute",
"Salymbekov University Faculty of Medicine",
"Scientific Research Medical Social Institute",
"University of Health Sciences (UHS) Faculty of Medical Sciences",
"Latvijas Universitātes Medicīnas Fakultātē",
"Rīga Stradiņš University Faculty of Medicine",
"American University of Beirut Faculty of Medicine",
"Beirut Arab University Faculty of Medicine",
"LAU Gilbert and Rose-Marie Chagoury School of Medicine",
"Lebanese University Faculty of Medical Sciences",
"University of Balamand Faculty of Medicine and Medical Sciences",
"Université Saint Esprit de Kaslik Faculté de Médecine et des Sciences Médicales",
"Université Saint-Joseph Faculté de Médecine",
"A. M. Dogliotti College of Medicine, University of Liberia",
"Al Asmarya University Zliten Medical School",
"Elmergib University Faculty of Medicine",
"Libyan International Medical University Faculty of Medicine",
"Misurata University Faculty of Medicine",
"Omar Al-Mukhtar University Faculty of Medicine",
"Sebha Medical University",
"Sirte University Faculty of Medicine",
"University of Benghazi Faculty of Medicine",
"University of Gharyan Faculty of Medicine",
"University of Tobruk College of Human Medicine",
"University of Tripoli Faculty of Medicine",
"University of Zawia Faculty of Medicine",
"Lithuanian University of Health Sciences Faculty of Medicine",
"Vilnius University Faculty of Medicine",
"Université d'Antananarivo Faculté de Médecine",
"Université de Mahajanga Faculté de Médecine",
"University of Malawi College of Medicine",
"Asia Metropolitan University Faculty of Medicine",
"Asian Institute of Medicine, Science and Technology (AIMST)",
"Cyberjaya University College of Medical Sciences",
"International Islamic University Malaysia Kulliyyah of Medicine",
"International Medical School, Management and Science University",
"International Medical University Faculty of Medicine and Health",
"Jeffrey Cheah School of Medicine and Health Sciences",
"Kulliyah of Medicine & Health Sciences Universiti Islam Antarabangsa Sultan Abdul Halim Muadzam Shah",
"Lincoln University College Faculty of Medicine",
"MAHSA University Faculty of Medicine",
"Melaka-Manipal Medical College",
"Newcastle University Medicine Malaysia",
"Perdana University Graduate School of Medicine",
"Perdana University Royal College of Surgeons in Ireland (PU-RCSI) School of Medicine",
"Quest International University Perak Faculty of Medicine",
"RCSI & UCD Malaysia Campus",
"SEGi University",
"Taylor's University School of Medicine",
"UCSI University Faculty of Medicine and Health Sciences",
"Universiti Kebangsaan Malaysia Fakulti Perubatan",
"Universiti Kuala Lumpur Royal College of Medicine Perak",
"Universiti Malaya Fakulti Perubatan",
"Universiti Malaysia Sabah Fakulti Perubatan dan Sains Kesihatan",
"Universiti Malaysia Sarawak Fakulti Perubatan dan Sains Kesihatan",
"Universiti Pertahanan Nasional Malaysia Fakulti Perubatan dan Kesihatan Pertahanan",
"Universiti Putra Malaysia Fakulti Perubatan dan Sains Kesihatan",
"Universiti Sains Islam Malaysia Fakulti Perubatan dan Sains Kesihatan",
"Universiti Sains Malaysia School of Medical Sciences",
"Universiti Sultan Zainal Abidin Faculty of Medicine",
"Universiti Teknologi Mara Faculty of Medicine",
"Universiti Tunku Abdul Rahman Faculty of Medicine and Health Sciences",
"Widad University College Faculty of Medicine",
"School of Medicine at the Maldives National University",
"Université des Sciences, des Techniques et des Technologies de Bamako Faculté de Médecine",
"Barts and The London School of Medicine Malta",
"University of Malta Faculty of Medicine and Surgery",
"Université de Nouakchott Al Aasriya Faculté de Médecine",
"Anna Medical College",
"SSR Medical College",
"University of Mauritius Faculty of Science, Department of Medicine",
"Benemérita Universidad Autónoma de Puebla Facultad de Medicina",
"Centro de Estudios Universitarios Xochicalco, Escuela de Medicina Ensenada",
"Centro de Estudios Universitarios Xochicalco, Escuela de Medicina Mexicali",
"Centro de Estudios Universitarios Xochicalco, Escuela de Medicina Tijuana",
"Escuela de Medicina José Bernardo Gutiérrez de Lara, A.C.",
"Escuela Médico Militar, Universidad del Ejército y Fuerza Aérea",
"Instituto de Ciencias y Estudios Superiores de Tamaulipas Matamoros Escuela de Medicina",
"Instituto de Ciencias y Estudios Superiores de Tamaulipas Tampico Escuela de Medicina",
"Instituto de Estudios Superiores de Chiapas Escuela de Medicina Tapachula",
"Instituto de Estudios Superiores de Chiapas Escuela de Medicina Tuxtla Gutierrez",
"Instituto de Estudios Superiores de Tamaulipas (IEST Anáhuac) Escuela de Medicina",
"Instituto Politécnico Nacional Centro Interdisciplinario de Ciencias de la Salud",
"Instituto Politécnico Nacional Escuela Nacional de Medicina y Homeopatía",
"Instituto Politécnico Nacional Escuela Superior de Medicina",
"Tecnológico de Monterrey Escuela de Medicina Ciudad de México",
"Tecnológico de Monterrey Escuela de Medicina Guadalajara",
"Tecnológico de Monterrey Escuela de Medicina Monterrey",
"Universidad Anáhuac Cancún Escuela Internacional de Medicina",
"Universidad Anáhuac Mayab Escuela de Medicina",
"Universidad Anáhuac México Escuela de Medicina",
"Universidad Anáhuac Querétaro Escuela de Medicina",
"Universidad Autónoma Benito Juárez de Oaxaca Facultad de Medicina y Cirugía",
"Universidad Autónoma de Aguascalientes Centro de Ciencias de la Salud",
"Universidad Autónoma de Baja California Escuela de Ciencias de la Salud Ensenada",
"Universidad Autónoma de Baja California Escuela de Ciencias de la Salud, Unidad Valle de las Palmas",
"Universidad Autónoma de Baja California Facultad de Medicina Mexicali",
"Universidad Autónoma de Baja California Tijuana Facultad de Medicina y Psicología",
"Universidad Autónoma de Campeche Facultad de Medicina",
"Universidad Autónoma de Chiapas Facultad de Medicina Humana",
"Universidad Autónoma de Chihuahua Facultad de Medicina",
"Universidad Autónoma de Ciudad Juárez Instituto de Ciencias Biomédicas",
"Universidad Autónoma de Coahuila Escuela de Medicina de Torreón",
"Universidad Autónoma de Coahuila Facultad de Medicina Saltillo",
"Universidad Autónoma de Durango Campus Chihuahua Escuela de Medicina",
"Universidad Autónoma de Durango Campus Ciudad Juárez Escuela de Medicina",
"Universidad Autónoma de Durango Campus Durango Facultad de Medicina",
"Universidad Autónoma de Durango Campus Laguna Escuela de Medicina",
"Universidad Autónoma de Durango Campus Los Mochis Facultad de Medicina",
"Universidad Autónoma de Durango Campus Zacatecas Escuela de Medicina",
"Universidad Autónoma de España Escuela de Ciencias Médicas",
"Universidad Autónoma de Guadalajara Facultad de Medicina Guadalajara",
"Universidad Autónoma de Guadalajara Facultad de Medicina Tabasco",
"Universidad Autónoma de Guerrero Facultad de Medicina",
"Universidad Autónoma de Nayarit Escuela de Medicina",
"Universidad Autónoma de Nuevo León Facultad de Medicina",
"Universidad Autónoma de Querétaro Facultad de Medicina",
"Universidad Autónoma de San Luis Potosí Facultad de Medicina",
"Universidad Autónoma de Sinaloa Facultad de Medicina Culiacán",
"Universidad Autónoma de Tamaulipas Facultad de Medicina de Tampico 'Dr. Alberto Romo Caballero'",
"Universidad Autónoma de Tamaulipas Facultad de Medicina Humana de Matamoros",
"Universidad Autónoma de Tlaxcala Facultad de Ciencias de la Salud",
"Universidad Autónoma de Yucatán Facultad de Medicina",
"Universidad Autónoma de Zacatecas Unidad Académica de Medicina y Ciencias de la Salud",
"Universidad Autónoma del Estado de Hidalgo Instituto de Ciencias de la Salud",
"Universidad Autónoma del Estado de Morelos Facultad de Medicina",
"Universidad Autónoma del Estado de México Facultad de Medicina",
"Universidad Autónoma Metropolitana Unidad Xochimilco",
"Universidad Cristóbal Colón Escuela de Medicina",
"Universidad Cuauhtémoc Campus San Luis Potosí Escuela de Medicina",
"Universidad Cuauhtémoc Plantel Aguascalientes Escuela de Medicina",
"Universidad Cuauhtémoc Plantel Guadalajara Escuela de Medicina",
"Universidad de Celaya Escuela de Medicina",
"Universidad de Colima Facultad de Medicina",
"Universidad de Guadalajara Centro Universitario de Ciencias de la Salud",
"Universidad de Guadalajara Centro Universitario de la Costa",
"Universidad de Guadalajara Centro Universitario de los Altos",
"Universidad de Guadalajara Centro Universitario de Tonalá",
"Universidad de Guadalajara Centro Universitario del Sur",
"Universidad de Guanajuato División de Ciencias de la Salud",
"Universidad de la Salle Facultad Mexicana de Medicina",
"Universidad de las Américas Puebla",
"Universidad de Montemorelos Escuela de Medicina",
"Universidad de Monterrey Facultad de Medicina",
"Universidad de Quintana Roo División de Ciencias de la Salud",
"Universidad de Sonora Departamento de Medicina y Ciencias de la Salud",
"Universidad del Noreste Escuela de Medicina 'Dr. José Sierra Flores'",
"Universidad del Valle de Atemajac (UNIVA)",
"Universidad del Valle de México Campus Ciudad Victoria Facultad de Medicina",
"Universidad del Valle de México Campus Hermosillo",
"Universidad del Valle de México Campus Querétaro Facultad de Medicina",
"Universidad del Valle de México Campus Reynosa Escuela de Medicina",
"Universidad del Valle de México Campus Villahermosa Escuela de Medicina",
"Universidad del Valle de México Campus Zapopan",
"Universidad Durango Santander Campus Hermosillo Escuela de Medicina",
"Universidad Hipócrates Area de Ceincias de la Salud",
"Universidad Justo Sierra Escuela de Medicina",
"Universidad Juárez Autónoma de Tabasco División Académica Multidisciplinaria de Comalcalco",
"Universidad Juárez Autónoma de Tabasco Escuela de Medicina Humana",
"Universidad Juárez del Estado de Durango Facultad de Ciencias de la Salud de Gómez Palacio",
"Universidad Juárez del Estado de Durango Facultad de Medicina y Nutrición",
"Universidad La Salle Victoria Facultad de Ciencias de la Salud",
"Universidad Lamar Escuela de Medicina, Campus Vallarta",
"Universidad Latina de México Escuela de Medicina",
"Universidad Latinoamericana Escuela de Medicina, Campus Cuernavaca",
"Universidad Marista de Mérida",
"Universidad Michoacana de San Nicolas de Hidalgo Facultad de Ciencias Médicas",
"Universidad México Americana del Norte Escuela de Medicina",
"Universidad Nacional Autónoma de México Facultad de Estudios Superiores Iztacala",
"Universidad Nacional Autónoma de México Facultad de Estudios Superiores Zaragoza",
"Universidad Nacional Autónoma de México Facultad de Medicina",
"Universidad Pablo Guajardo Chávez",
"Universidad Panamericana Escuela de Medicina",
"Universidad Popular Autónoma del Estado de Puebla Facultad de Medicina",
"Universidad Quetzalcóatl en Irapuato Escuela de Medicina",
"Universidad Regional del Sureste Escuela de Medicina e Cirugía",
"Universidad Tominaga Nakamoto Escuela de Medicina",
"Universidad Vasco de Quiroga Escuela de Medicina General",
"Universidad Veracruzana Facultad de Medicina Minatitlán",
"Universidad Veracruzana Facultad de Medicina Orizaba-Córdoba",
"Universidad Veracruzana Facultad de Medicina Poza Rica",
"Universidad Veracruzana Facultad de Medicina Veracruz",
"Universidad Veracruzana Facultad de Medicina Xalapa",
"Universidad Westhill Facultad de Medicina",
"New Tokyo Medical College",
"State University of Medicine and Pharmacy Nicolae Testemitanu",
"Ach Medical University",
"Darkhan-Uul Medical College",
"Gobi-Altai Medical College",
"Mongolian National University of Medical Sciences School of Medicine",
"Otoch Manramba Traditional Medical University",
"Sainshand Medical College",
"Ulaanbaatar Medical College",
"University of Montenegro Faculty of Medicine",
"Université Cadi Ayyad Faculté de Médecine et de Pharmacie de Marrakech",
"Université Hassan II de Casablanca Faculté de Médecine et de Pharmacie",
"Université Internationale Abulcasis des Sciences de la Santé Faculté de Médecine",
"Université Mohammed I Faculté de Médecine et de Pharmacie Oujda",
"Université Mohammed V de Rabat Faculté de Médecine et de Pharmacie",
"Université Mohammed VI des Sciences de la Santé Faculté de Médecine",
"Université Sidi Mohammed Ben Abdellah Faculté de Médecine et de Pharmacie de Fès",
"Universidade Católica de Moçambique Faculdade de Ciências de Saúde",
"Universidade Eduardo Mondlane Faculdade de Medicina",
"Universidade Lúrio Faculdade de Ciências de Saúde",
"Defence Services Medical Academy",
"University of Medicine 1",
"University of Medicine 2",
"University of Medicine Magway",
"University of Medicine Mandalay",
"University of Medicine Taunggyi",
"University of Namibia School of Medicine",
"B.P. Koirala Institute of Health Sciences",
"Birat Medical College",
"Chitwan Medical College",
"College of Medical Sciences, Bharatpur",
"Devdaha Medical College & Resarch Institute",
"Gandaki Medical College",
"Institute of Medicine, Tribhuvan University",
"Janaki Medical College",
"Kathmandu Medical College",
"Kathmandu University School of Medical Sciences",
"KIST Medical College",
"Lumbini Medical College and Teaching Hospital",
"Manipal College of Medical Sciences (MCOMS)",
"National Medical College, Birgunj",
"Nepal Medical College",
"Nepalese Army Institute of Health Sciences College of Medicine",
"Nepalgunj Medical College",
"Nobel Medical College",
"Patan Academy of Health Sciences School of Medicine",
"Universal College of Medical Sciences",
"Erasmus Universiteit Faculteit der Geneeskunde",
"Leiden University Medical Center",
"Maastricht University Faculty of Health, Medicine and Life Sciences",
"Radboud Universiteit Nijmegen Faculteit der Medische Wetenschappen",
"Rijksuniversiteit Groningen Faculteit der Medische Wetenschappen",
"Universiteit Utrecht Faculteit Geneeskunde",
"Universiteit van Amsterdam Faculteit der Geneeskunde",
"VUmc School of Medical Sciences",
"Otago Medical School",
"University of Auckland Faculty of Medicine and Health Sciences",
"Facultad de Medicina del Hospital Militar de Nicaragua",
"Universidad Americana (UAM) Facultad de Medicina",
"Universidad Católica 'Redemptoris Máter' (UNICA) Facultad de Ciencias Médicas",
"Universidad Católica del Trópico Seco Facultad de Ciencias Médicas",
"Universidad Central de Nicaragua Facultad de Medicina",
"Universidad Centroamericana de Ciencias Empresariales Facultad de Ciencias Médicas",
"Universidad Cristiana Autónoma de Nicaragua Facultad de Medicina",
"Universidad de Ciencias Médicas",
"Universidad Internacional para el Desarrollo Sostenible (UNIDES) Juigalpa",
"Universidad Internacional para el Desarrollo Sostenible (UNIDES) Managua",
"Universidad Internacional para el Desarrollo Sostenible (UNIDES) Matagalpa",
"Universidad Nacional Autónoma de Nicaragua Facultad de Ciencias Médicas León",
"Universidad Nacional Autónoma de Nicaragua Facultad de Ciencias Médicas Managua",
"Université Abdou Moumouni de Niamey Faculté des Sciences de la Santé",
"Abia State University Faculty of Medicine",
"Abubakar Tafawa Balewa University College of Medicine",
"Afe Babalola University College of Medicine and Health Sciences",
"Ahmadu Bello University Faculty of Medicine",
"Alex Ekwueme Federal University Ndufu Alike Ikwo Faculty of Basic Medical Sciences",
"Ambrose Alli University College of Medicine",
"Bayero University Faculty of Medicine",
"Benjamin S. Carson College of Health and Medical Sciences, Babcock University",
"Benue State University College of Health Sciences",
"Bingham University College of Health Sciences",
"Bowen University College of Health Sciences",
"Chukwuemeka Odumegwu Ojukwu University College of Medical Sciences",
"Delta State University College of Health Sciences",
"Ebonyi State University College of Health Sciences",
"Edo University Iyamho College of Medical Sciences",
"Ekiti State University College of Medicine",
"Enugu State University of Science and Technology College of Medicine",
"Gombe State University College of Medical Sciences",
"Gregory University College of Medicine and Health Sciences",
"Imo State University College of Medicine",
"Kaduna State University Faculty of Medicine",
"Ladoke Akintola University of Technology (LAUTECH) College of Health Sciences",
"Lagos State University College of Medicine",
"Madonna University College of Medicine",
"Niger Delta University College of Medical Sciences",
"Nile University of Nigeria College of Health Sciences",
"Nnamdi Azikiwe University College of Health Sciences",
"Oba Okunade Sijuade College of Health Sciences, Igbinedion University",
"Obafemi Awolowo College of Health Sciences, Olabisi Onabanjo University",
"Obafemi Awolowo University College of Health Sciences",
"Ondo State University of Medical Sciences",
"University of Abuja College of Health Sciences",
"University of Benin College of Medical Sciences",
"University of Calabar College of Medical Sciences",
"University of Ibadan College of Medicine",
"University of Ilorin College of Health Sciences",
"University of Jos College of Health Sciences",
"University of Lagos College of Medicine",
"University of Maiduguri College of Medical Sciences",
"University of Nigeria College of Medicine",
"University of Port Harcourt College of Health Sciences",
"University of Uyo College of Health Sciences",
"Usmanu Danfodiyo University College of Health Sciences",
"Goce Delcev University Faculty of Medical Sciences",
"Ss. Cyril and Methodius University in Skopje Faculty of Medicine",
"State University of Tetova Faculty of Medical Sciences",
"Norwegian University of Science and Technology (NTNU) Faculty of Medicine",
"Universitetet i Bergen Medisinske Fakultet",
"Universitetet i Oslo Medisinske Fakultet",
"Universitetet i Tromsø Helsevitenskapelige Fakultet",
"National University of Science and Technology College of Medicine and Health Sciences",
"Sultan Qaboos University College of Medicine",
"Abbottabad International Medical College",
"Aga Khan University Medical College",
"Akhtar Saeed Medical & Dental College",
"Al-Aleem Medical College",
"Al-Nafees Medical College",
"Al-Tibri Medical College",
"Allama Iqbal Medical College",
"Ameer-ud-Din Medical College",
"Amna Inayat Medical College",
"Army Medical College",
"Avicenna Medical College",
"Ayub Medical College",
"Azad Jammu & Kashmir Medical College",
"Aziz Fatimah Medical & Dental College",
"Azra Naheed Medical College",
"Bacha Khan Medical College",
"Bahria University Medical & Dental College",
"Bakhtawar Amin Medical and Dental College",
"Bannu Medical College",
"Baqai Medical College",
"Bolan Medical College",
"C.M.H. Kharian Medical College",
"C.M.H. Lahore Medical College and Institute of Dentistry",
"C.M.H. Multan Institute of Medical Sciences",
"Central Park Medical College",
"Chandka Medical College",
"Continental Medical College",
"Dow International Medical College (DIMC)",
"Dow Medical College",
"F.M.H. College of Medicine and Dentistry",
"Faisalabad Medical University",
"Fatima Jinnah Medical University",
"Fazaia Medical College",
"Federal Medical and Dental College",
"Foundation University Medical College (FUMC)",
"Frontier Medical & Dental College, Abbottabad",
"Ghazi Khan Medical College",
"Ghulam Muhammad Mahar Medical College",
"Gomal Medical College",
"Gujranwala Medical College",
"H.B.S. Medical & Dental College",
"Hamdard College of Medicine & Dentistry",
"HITEC Institute of Medical Sciences",
"Independent Medical College",
"Indus Medical College",
"Islam Medical College",
"Islamabad Medical & Dental College",
"Islamic International Medical College",
"Isra University, Hyderabad Faculty of Medicine and Allied Medical Sciences",
"Jinnah Medical and Dental College",
"Jinnah Medical College",
"Jinnah Sindh Medical University",
"Kabir Medical College",
"Karachi Institute of Medical Sciences (KIMS)",
"Karachi Medical and Dental College",
"Khawaja Muhammad Safdar Medical College",
"Khyber Girls Medical College",
"Khyber Medical College",
"King Edward Medical University",
"KMU Institute of Medical Sciences",
"Lahore Medical and Dental College",
"Liaquat College of Medicine and Dentistry",
"Liaquat National Hospital and Medical College",
"Liaquat University of Medical & Health Sciences Jamshoro",
"M. Islam Medical and Dental College",
"Mohiuddin Islamic Medical College",
"Mohtarma Benazir Bhutto Shaheed Medical College",
"Muhammad Medical College",
"Multan Medical and Dental College",
"Nawaz Sharif Medical College",
"Nishtar Medical University",
"Northwest School of Medicine",
"Nowshera Medical College",
"Pak International Medical College",
"Pak Red Crescent Medical & Dental College",
"People's University of Medical & Health Sciences for Women",
"Peshawar Medical College",
"Poonch Medical College",
"Quaid-e-Azam Medical College",
"Quetta Institute of Medical Sciences",
"Rahbar Medical and Dental College",
"Rai Medical College",
"Rashid Latif Medical College",
"Rawal Institute of Health Sciences",
"Rawalpindi Medical University",
"Rehman Medical College",
"Sahara Medical College",
"Sahiwal Medical College",
"Saidu Medical College",
"Sargodha Medical College",
"Services Institute of Medical Sciences",
"Shaheed Mohtarma Benazir Bhutto Medical College",
"Shahida Islam Medical College",
"Shaikh Khalifa Bin Zayed Al-Nahyan Medical and Dental College",
"Shalamar Medical and Dental College",
"Sharif Medical and Dental College",
"Sheikh Zayed Medical College and Hospital",
"Shifa College of Medicine",
"Sialkot Medical College",
"Sir Syed College of Medical Sciences for Girls",
"United Medical & Dental College",
"University College of Medicine & Dentistry Lahore",
"University Medical & Dental College Faisalabad",
"Wah Medical College",
"Women Medical & Dental College",
"Ziauddin Medical College",
"Columbus University College of Medicine and Health Sciences",
"Universidad Autónoma de Chiriquí Facultad de Medicina",
"Universidad de Panamá Facultad de Medicina",
"Universidad Interamericana de Panamá Facultad de Ciencias de la Salud",
"Universidad Latina de Panamá Facultad de Ciencias de la Salud Dr. William C. Gorgas",
"Divine Word University Faculty of Medicine and Health Sciences",
"University of Papua New Guinea School of Medicine and Health Sciences",
"Universidad Católica Nuestra Señora de la Asunción Facultad de Ciencias de la Salud, Asunción",
"Universidad Católica Nuestra Señora de la Asunción Facultad de Ciencias de la Salud, Guairá",
"Universidad de la Integración de las Américas (UNIDA) Facultad de la Salud",
"Universidad del Norte Facultad de Medicina Sede Asunción",
"Universidad del Pacífico Privada Facultad de Medicina",
"Universidad María Auxiliadora (UMAX) Facultad de Medicina",
"Universidad María Serrana Facultad de Medicina",
"Universidad Nacional de Asunción Facultad de Medicina",
"Universidad Nacional de Itapúa Facultad de Medicina",
"Universidad Nacional del Este Facultad de Ciencias de la Salud",
"Universidad Alas Peruanas Facultad de Medicina Humana y Ciencias de la Salud",
"Universidad Andina del Cusco Facultad de Ciencias de la Salud",
"Universidad Andina Néstor Cáceres Velásquez Escuela Profesional Medicina Humana",
"Universidad Católica de Santa María Facultad de Medicina Humana",
"Universidad Católica Santo Toribio de Mogrovejo (USAT) Facultad de Medicina",
"Universidad Científica del Sur Facultad de Ciencias de la Salud",
"Universidad Continental Escuela de Medicina Humana",
"Universidad César Vallejo Facultad de Ciencias Médicas",
"Universidad de Piura Facultad de Medicina Humana",
"Universidad de San Martin de Porres Facultad de Medicina Humana",
"Universidad Nacional Daniel Alcídes Carrión Facultad de Medicina Humana",
"Universidad Nacional de Cajamarca Facultad de Medicina Humana",
"Universidad Nacional de la Amazonía Peruana Facultad de Medicina Humana",
"Universidad Nacional de Piura Facultad de Medicina Humana",
"Universidad Nacional de San Agustín Facultad de Medicina",
"Universidad Nacional de San Cristóbal de Huamanga Escuela Profesional de Medicina Humana",
"Universidad Nacional de San Martín Facultad de Medicina Humana",
"Universidad Nacional de Trujillo Facultad de Medicina",
"Universidad Nacional de Tumbes Escuela de Medicina Humana",
"Universidad Nacional de Ucayali Facultad de Medicina Humana",
"Universidad Nacional del Altiplano Escuela Profesional de Medicina Humana",
"Universidad Nacional del Centro de Perú Facultad de Medicina Humana",
"Universidad Nacional del Santa Escuela Profesional de Medicina Humana",
"Universidad Nacional Federico Villarreal Facultad de Medicina 'Hipólito Unanue'",
"Universidad Nacional Hermilio Valdizán Escuela de Medicina Humana",
"Universidad Nacional Jorge Basadre Grohmann Escuela Profesional de Medicina Humana",
"Universidad Nacional José Faustino Sánchez Carrión Facultad de Medicina Humana",
"Universidad Nacional Mayor de San Marcos Facultad de Medicina San Fernando",
"Universidad Nacional Pedro Ruiz Gallo Facultad de Medicina Humana",
"Universidad Nacional San Antonio Abad del Cusco Facultad de Medicina Humana",
"Universidad Nacional San Luis Gonzaga de Ica Facultad de Medicina Humana Dr. Daniel Alcides Carrión",
"Universidad Nacional Toribio Rodríguez de Mendoza de Amazonas Facultad de Ciencias de la Salud",
"Universidad Particular de Chiclayo Escuela Profesional de Medicina Humana",
"Universidad Peruana Cayetano Heredia Facultad de Medicina Alberto Hurtado",
"Universidad Peruana de Ciencias Aplicadas (UPC) Escuela de Medicina",
"Universidad Peruana Los Andes Facultad de Medicina Humana",
"Universidad Peruana Unión Facultad de Ciencias de la Salud",
"Universidad Privada Antenor Orrego Facultad de Medicina Humana (UPAO)",
"Universidad Privada de Tacna Facultad de Ciencias de la Salud",
"Universidad Privada Norbert Wiener Facultad de Ciencias de la Salud",
"Universidad Privada San Juan Bautista Escuela Profesional de Medicina Humana",
"Universidad Ricardo Palma Facultad de Medicina Humana",
"Universidad San Pedro Facultad de Medicina Humana",
"Universidad Señor de Sipán Escuela de Medicina Humana",
"Adventist University of the Philippines College of Medicine",
"AMA School of Medicine",
"Angeles University Foundation School of Medicine",
"Ateneo de Zamboanga University College of Medicine",
"Ateneo School of Medicine and Public Health",
"Bicol Christian College of Medicine",
"Bicol University College of Medicine",
"Cagayan State University College of Medicine and Surgery",
"Cebu Doctors' University College of Medicine",
"Cebu Institute of Medicine",
"Central Philippine University College of Medicine",
"Davao Medical School Foundation College of Medicine",
"De La Salle Medical and Health Sciences Institute College of Medicine",
"Dr. Francisco Q. Duque Medical Foundation College of Medicine",
"Dr. Jose P. Rizal College of Medicine",
"Emilio Aguinaldo College School of Medicine",
"Far Eastern University Institute of Medicine, Nicanor Reyes Medical Foundation",
"Gullas College of Medicine, University of the Visayas",
"Iloilo Doctors' College of Medicine",
"Manila Central University-Filemon D. Tanchoco Foundation College of Medicine",
"Mariano Marcos State University College of Medicine",
"Matias H. Aznar Memorial College of Medicine",
"Mindanao State University College of Medicine",
"Our Lady of Fatima University College of Medicine",
"PLT College Inc College of Medicine",
"Remedios T. Romualdez Medical Foundation College of Medicine",
"San Beda University College of Medicine",
"School of Health Sciences, University of the Philippines System",
"Silliman University Medical School",
"Southwestern University School of Medicine",
"St. Louis University School of Medicine",
"St. Luke's Medical Center College of Medicine - William H. Quasha Memorial (SLMCCM-WHQM)",
"St. Paul University Philippines School of Medicine",
"University of Cebu College of Medicine",
"University of Northern Philippines College of Medicine",
"University of Perpetual Help System Dalta Jonelta Foundation School of Medicine",
"University of Perpetual Help System Dr. Jose G. Tamayo Medical University",
"University of Saint La Salle College of Medicine",
"University of Santo Tomas Faculty of Medicine and Surgery",
"University of the City of Manila College of Medicine",
"University of the East/Ramon Magsaysay Memorial Medical Center College of Medicine",
"University of the Philippines Manila College of Medicine",
"Virgen Milagrosa University Foundation College of Medicine",
"West Visayas State University College of Medicine",
"Collegium Medicum im. Ludwika Rydygiera, Uniwersytet Mikolaja Kopernika w Toruniu",
"Faculty of Medicine and Dentistry in Zabrze",
"Jagiellonian University Medical College",
"Jan Kochanowski University Collegium Medicum",
"Krakowska Akademia im. Andrzeja Frycza Modrzewskiego Wydział Lekarski i Nauk o Zdrowiu",
"Medical University of Bialystok Faculty of Medicine",
"Medical University of Gdańsk Faculty of Medicine",
"Medical University of Lodz Faculty of Medicine",
"Medical University of Lublin",
"Medical University of Silesia in Katowice Faculty of Medical Sciences Katowice",
"Medical University of Warsaw Faculty of Medicine",
"Opole University Faculty of Medicine",
"Pomorski Uniwersytet Medyczny w Szczecinie",
"Poznan University of Medical Sciences Center for Medical Education in English",
"Poznan University of Medical Sciences, Faculty of Medicine I",
"Uczelnia Łazarskiego Wydział Medyczny",
"University of Rzeszów Faculty of Medicine",
"University of Warmia and Mazury in Olsztyn, Collegium Medicum, School of Medicine",
"University of Zielona Góra Faculty of Medicine and Health Sciences",
"Wroclaw Medical University Faculty of Medcine",
"Wyższa Szkoła Techniczna w Katowicach Wydział Nauk Medycznych",
"Instituto de Ciências Biomédicas Abel Salazar",
"Universidade da Beira Interior Faculdade de Ciências da Saúde",
"Universidade de Coimbra Faculdade de Medicina",
"Universidade de Lisboa Faculdade de Medicina",
"Universidade do Algarve Departamento de Ciências Biomédicas e Medicina",
"Universidade do Minho Escola de Medicina",
"Universidade do Porto Faculdade de Medicina",
"Universidade Nova de Lisboa Faculdade de Ciências Médicas",
"Qatar University College of Medicine",
"Weill Cornell Medical College in Qatar",
"Universitatea 'Dunărea de Jos' din Galați Facultatea de Medicină și Farmacie",
"Universitatea de Medicină și Farmacie Carol Davila Facultatea de Medicină",
"Universitatea de Medicină și Farmacie din Craiova Facultatea de Medicină",
"Universitatea de Medicină și Farmacie Grigore T. Popa Facultatea de Medicină",
"Universitatea de Medicină și Farmacie Iuliu Haţieganu Facultatea de Medicină",
"Universitatea de Medicină și Farmacie Victor Babeş Facultatea de Medicină",
"Universitatea de Medicină, Farmacie, Științe și Tehnologie 'George Emil Palade' Târgu Mureș",
"Universitatea de Vest Vasile Goldis din Arad Facultatea de Medicină",
"Universitatea din Oradea Facultatea de Medicină și Farmacie",
"Universitatea Lucian Blaga din Sibiu Facultatea de Medicină 'Victor Papilian'",
"Universitatea Ovidius Constanta Facultatea de Medicină",
"Universitatea Titu Maiorescu Facultatea de Medicină și Medicină Dentara",
"Universitatea Transilvania din Brașov Facultatea de Medicină",
"Altai State Medical University",
"Amur State Medical Academy",
"Astrakhan State Medical University",
"Bashkir State Medical University",
"Belgorod National Research University Medical Institute",
"Buryat State University Institute of Medicine",
"Cecenja State University Medical Institute",
"Chita State Medical Academy",
"Chuvash State University Medical Institute",
"Dagestan State Medical University",
"Far Eastern Federal University School of Biomedicine",
"Far Eastern State Medical University",
"First Moscow State Medical University named after I. M. Sechenov",
"Immanuel Kant Baltic Federal University Institute of Medicine",
"Ingush State University Faculty of Medicine",
"Institute of the Federal Security Service of the Russian Federation",
"Irkutsk State Medical University",
"Ivanovo State Medical Academy",
"Izhevsk State Medical Academy (ISMA)",
"Kabardino-Balkarian State University Faculty of Medicine",
"Kaluga State University named after K. E. Tsiolkovsky Medical Institute",
"Kazan Federal University Institute of Fundamental Medicine and Biology",
"Kazan State Medical University",
"Kemerovo State Medical University",
"Khakasia State University named after N. F. Katanov Institute of Medicine, Psychology and Sociology",
"Khanty-Mansiysk State Medical Academy",
"Kirov State Medical University",
"Kirov State Medical University, Komi Branch",
"Krasnoyarsk State Medical University named after Professor V. F. Voino-Yasenetsky",
"Kuban Medical Institute",
"Kuban State Medical University",
"Kursk State Medical University",
"Lobachevsky State University of Nizhny Novgorod Institute of Biology and Biomedicine",
"Lomonosov Moscow State University Faculty of Medicine",
"Mari State University Medical Faculty",
"Maykop State Technological University Medical Institute",
"Medical Institute of Tambov State University named after G. R. Derzhavin",
"Medical University Reaviz Moscow",
"Medical University Reaviz Samara",
"Medical University Reaviz Saratov",
"Medical University Reaviz St. Petersburg",
"Military Medical Academy S. M. Kirov",
"Mordovian State University 'N. P. Ogarev' Medical Faculty",
"Moscow State University of Medicine and Dentistry named after A. I. Evdokimov",
"National Medical Research Centre named after V. A. Almazov",
"National Nuclear Research University 'MEPhI' Engineering Physics Institute of Biomedicine",
"North Caucasian State Humanitarian Technological Academy",
"North Ossetian State Medical Academy",
"North-Eastern Federal University named after Maxim Kirovich Ammosov Institute of Medicine",
"North-Western State Medical University I. I. Mechnikov",
"Northern State Medical University",
"Novosibirsk State Medical University",
"Novosibirsk State University Institute of Medicine and Psychology V. Zelman",
"Obninsk Institute of Atomic Energy, National Nuclear Research University 'MEPI' Medical Faculty",
"Omsk State Medical University",
"Orenburg State Medical University",
"Oryol State University Medical Institute",
"Pacific State Medical University",
"Penza State University Medical Institute",
"People's Friendship University of Russia Faculty of Medicine",
"Perm State Medical University named after Academician E. A. Wagner",
"Petrozavodsk State University Institute of Medicine (PetrSU)",
"Pitirim Sorokin Syktyvkar State University Medical Institute",
"Privolzhsky Research Medical University",
"Pskov State University Institute of Medicine and Experimental Biology",
"Rostov State Medical University",
"Russian National Research Medical University named after N. I. Pirogov",
"Ryazan State Ivan Petrovich Pavlov Medical University Medical Faculty",
"Saint Petersburg Medico-Social Institute",
"Saint Petersburg Pavlov State Medical University",
"Saint Petersburg State University Faculty of Medicine",
"Saint-Petersburg State Pediatric-Medical University",
"Samara State Medical University",
"Saratov State Medical University named after V. I. Razumovsky",
"Siberian State Medical University",
"Smolensk State Medical University",
"South-Ural State Medical University",
"State Classical Academy named for Maimonid Medical Faculty",
"Stavropol State Medical University",
"Surgut State University Institute of Medicine",
"Tula State University Medical Institute",
"Tver State Medical University",
"Tyumen State Medical University",
"Ulyanovsk State University Medical Faculty named after T. Z. Biktimirov",
"Ural State Medical University",
"Volgograd State Medical University",
"Voronezh State Medical University Named after N. N. Burdenko",
"Yaroslav-the-Wise Novgorod State University Institute of Medical Education",
"Yaroslavl State Medical University",
"University of Global Health Equity",
"University of Rwanda College of Medicine and Health Sciences",
"International University of the Health Sciences (IUHS)",
"Medical University of the Americas (Nevis)",
"Universal Caribbean University School of Medicine",
"University of Medicine and Health Sciences, St. Kitts",
"Windsor University School of Medicine",
"American International Medical University School of Medicine",
"Atlantic University School of Medicine",
"College of Medicine and Health Sciences, St. Lucia",
"International American University College of Medicine",
"Spartan Health Sciences University School of Medicine",
"Washington Medical Sciences Institute",
"All Saints University College of Medicine",
"American University of St. Vincent School of Medicine",
"Saint James School of Medicine St. Vincent and the Grenadines (SJSM)",
"Saint Teresa University School of Medicine",
"Trinity School of Medicine",
"National University of Samoa School of Medicine",
"Oceania University of Medicine",
"Al Baha University School of Medicine",
"Al Jouf University College of Medicine",
"Al Rayan Medical College",
"Al-Imam Muhammad Bin Saud Islamic University College of Medicine",
"Alfaisal University College of Medicine",
"Almaarefa Medical College",
"Almajmaah University College of Medicine",
"Batterjee Medical College for Sciences and Technology",
"College of Medicine Jeddah, King Saud Bin Abdulaziz University for Health Sciences",
"College of Medicine of Vision Colleges",
"Dar Al Uloom University College of Medicine",
"Faculty of Medicine in Al-Qunfudah, Umm Al-Qura University",
"Ibn Sina National College for Medical Studies Faculty of Medicine",
"Imam Abdulrahman Bin Faisal University College of Medicine",
"Jazan University Faculty of Medicine",
"King Abdulaziz University College of Medicine",
"King Fahad Medical City Faculty of Medicine",
"King Faisal University, College of Medicine in Al-Ahsa",
"King Khalid University College of Medicine and Health Sciences",
"King Saud bin Abdulaziz University for Health Sciences College of Medicine",
"King Saud University, Riyadh College of Medicine",
"Najran University College of Medicine",
"Northern Borders University College of Medicine",
"Prince Sattam bin Abdulaziz University College of Medicine",
"Princess Nourah Bint Abdulrahman University College of Medicine",
"Qassim University College of Medicine",
"Sulaiman Alrajhi College of Medicine",
"Taibah University College of Medicine",
"Taif University College of Medicine",
"Umm Al-Qura University Faculty of Medicine",
"Unaizah College of Medicine and Medical Sciences, Qassim University",
"University of Ha’il College of Medicine",
"University of Jeddah Faculty of Medicine",
"University of Tabuk Faculty of Medicine",
"St. Christopher Iba Mar Diop College of Medicine",
"Université Cheikh Anta Diop Faculté de Médecine, de Pharmacie et d'Odontologie",
"Military Medical Academy Medical Faculty, University of Defense",
"University of Belgrade Faculty of Medicine",
"University of Kragujevac Faculty of Medical Sciences",
"University of Nis Faculty of Medicine",
"University of Nis International College of Medicine",
"University of Novi Sad Faculty of Medicine",
"University of Sierra Leone College of Medicine & Allied Health Sciences",
"Duke-NUS Medical School",
"Lee Kong Chian School of Medicine",
"Yong Loo Lin School of Medicine, National University of Singapore",
"Jesseniova Lekárska Fakulta v Martine, Univerzita Komenského",
"Slovenská Zdravotnícka Univerzita v Bratislave",
"Univerzita Komenského v Bratislave, Lekárska Fakulta",
"Univerzita P. J. Safárika Lekárska Fakulta",
"University of Ljubljani Faculty of Medicine",
"University of Maribor Faculty of Medicine",
"Abrar University College of Medicine & Surgery",
"Amoud University School of Medicine and Surgery",
"Benadir University Faculty of Medicine and Surgery",
"Capital University Faculty of Medicine",
"East Africa University Faculty of Medicine",
"Gollis University Faculty of Medicine and Surgery",
"Hope University Faculty of Medicine",
"Jamhuriya University of Science and Technology Faculty of Medicine & Health Science",
"Jazeera University Faculty of Medicine and Surgery",
"Kismayo University Faculty of Medicine and Health Science",
"Mogadishu University Faculty of Medicine & Surgery",
"Plasma University Faculty of Medicine & Surgery",
"Salaam University Faculty of Medicine and Surgery",
"Simad University Faculty of Medicine and Health Sciences",
"Somali International University Faculty of Medicine and Health Sciences",
"Somali National University Faculty of Medicine and Health Science",
"University of Hargeisa School of Medicine and Health Sciences",
"University of Health Sciences Faculty of Medicine",
"University of Somalia Faculty of Health Sciences",
"Zamzam University of Science and Technology Faculty of Medicine",
"Sefako Makgatho Health Science University",
"University of Cape Town Faculty of Health Sciences",
"University of Kwazulu-Natal College of Health Sciences",
"University of Pretoria School of Medicine",
"University of Stellenbosch Faculty of Medicine and Health Sciences",
"University of the Free State Faculty of Health Sciences",
"University of the Witwatersrand Faculty of Health Sciences",
"Walter Sisulu University Faculty of Health Sciences",
"Bahr El Ghazal University Faculty of Medicine",
"University of Juba College of Medicine",
"Upper Nile University Faculty of Medicine and Health Sciences",
"Euskal Herriko Unibertsitatea Medikuntza eta Odontologia Fakultatea",
"Universidad Alfonso X el Sabio Facultad de Ciencias de la Salud",
"Universidad Autónoma de Madrid Facultad de Medicina",
"Universidad Católica de Valencia San Vicente Mártir Facultad de Medicina y Ciencias de la Salud",
"Universidad Católica San Antonio de Murcia Facultad de Ciencias de la Salud",
"Universidad CEU Cardenal Herrera Facultad de Ciencias de la Salud Castellón",
"Universidad CEU Cardenal Herrera Facultad de Ciencias de la Salud Valencia",
"Universidad CEU San Pablo Facultad de Medicina",
"Universidad Complutense de Madrid Facultad de Medicina",
"Universidad de Alcalá Facultad de Medicina",
"Universidad de Cantabria Facultad de Medicina",
"Universidad de Castilla-La Mancha Facultad de Medicina de Albacete",
"Universidad de Castilla-La Mancha Facultad de Medicina de Ciudad Real",
"Universidad de Cádiz Facultad de Medicina",
"Universidad de Córdoba Facultad de Medicina y Enfermería",
"Universidad de Extremadura Facultad de Medicina",
"Universidad de Granada Facultad de Medicina",
"Universidad de La Laguna Facultad de Medicina",
"Universidad de Las Palmas de Gran Canaria Facultad de Ciencias de la Salud",
"Universidad de Murcia Facultad de Medicina",
"Universidad de Málaga Facultad de Medicina",
"Universidad de Navarra Facultad de Medicina",
"Universidad de Oviedo Facultad de Medicina y Ciencias de la Salud",
"Universidad de Salamanca Facultad de Medicina",
"Universidad de Sevilla Facultad de Medicina",
"Universidad de Valladolid Facultad de Medicina",
"Universidad de Zaragoza Facultad de Medicina",
"Universidad Europea de Madrid Facultad de Ciencias Biomédicas",
"Universidad Francisco de Vitoria Facultad de Ciencias Biosanitarias",
"Universidad Miguel Hernández de Elche Facultad de Medicina",
"Universidad Rey Juan Carlos Facultad de Ciencias de la Salud",
"Universidad Santiago de Compostela Facultade de Medicina e Odontoloxía",
"Universitat Autònoma de Barcelona Facultat de Medicina",
"Universitat de Barcelona Facultat de Medicina",
"Universitat de Girona Facultat de Medicina",
"Universitat de les Illes Balears Facultat de Medicina",
"Universitat de Lleida Facultat de Medicina",
"Universitat de València Facultat de Medicina e Odontologia",
"Universitat de Vic - Universitat Central de Catalunya (UVic-UCC) Facultat de Medicina",
"Universitat Internacional de Catalunya Facultat de Medicina i Ciències de la Salut",
"Universitat Jaume I Facultat de Ciències de la Salut",
"Universitat Pompeu Fabra Facultat de Ciències de la Salut i de la Vida",
"Universitat Rovira i Virgili Facultat de Medicina i Ciències de la Salut de Reus",
"Faculty of Health-Care Sciences, Eastern University, Sri Lanka",
"General Sir John Kotelawala Defence University Faculty of Medicine",
"Rajarata University of Sri Lanka Faculty of Medicine and Allied Sciences",
"University of Colombo Faculty of Medicine",
"University of Jaffna Faculty of Medicine",
"University of Kelaniya Faculty of Medicine",
"University of Peradeniya Faculty of Medicine",
"University of Ruhuna Faculty of Medicine",
"University of Sri Jayewardenepura Faculty of Medical Sciences",
"Ahfad University for Women School of Medicine",
"Al Neelain University Faculty of Medicine",
"Al-Yarmouk College Faculty of Medical Sciences",
"Alfashir University Faculty of Medicine and Health Sciences",
"Almughtaribeen University Faculty of Medicine",
"Alzaiem Alazhari University Faculty of Medicine",
"Bayan College of Science and Technology",
"Eastern Sudan College for Medical Sciences and Technology",
"Elrazi University",
"Faculty of Medicine, National University - Sudan",
"Ibn Sina University Faculty of Medicine & Surgery",
"International University of Africa Faculty of Medicine & Health Sciences",
"Karary University College of Medicine and Surgery",
"Kassala University Faculty of Medicine",
"Nahda College",
"Napata College",
"National Ribat University College of Medicine",
"Nile College Faculty of Medicine",
"Nile Valley University Faculty of Medicine and Health Sciences",
"Omdurman Ahlia University Faculty of Medicine",
"Omdurman Islamic University Faculty of Medicine and Health Sciences",
"Red Sea University Faculty of Medicine and Health Sciences",
"Shendi University Faculty of Medicine and Health Sciences",
"Sinnar University Faculty of Medicine",
"Sudan International University Faculty of Medicine",
"University of Bahri College of Medicine",
"University of Bakht Alruda Faculty of Medicine and Health Sciences",
"University of Dongola Faculty of Medicine and Health Sciences",
"University of El Imam El Mahdi Faculty of Medicine Kosti",
"University of Gadarif Faculty of Medicine and Health Science",
"University of Gezira Faculty of Medicine",
"University of Khartoum Faculty of Medicine",
"University of Kordofan Faculty of Medicine and Health Sciences",
"University of Medical Sciences & Technology (UMST) Faculty of Medicine",
"University of Nyala Faculty of Medicine",
"University of Science and Technology Faculty of Medicine",
"Wad Medani College of Medical Sciences and Technology",
"West Kordufan University Faculty of Medicine and Health Science",
"Anton de Kom Universiteit van Suriname Faculteit der Medische Wetenschappen",
"Karolinska Institute Faculty of Medicine",
"Linköping University Faculty of Medicine and Health Sciences",
"Lund University Faculty of Medicine",
"Sahlgrenska Academy, University of Gothenburg",
"Umea University Faculty of Medicine",
"Uppsala University Faculty of Medicine",
"Örebro University School of Medical Sciences",
"Universität Basel Medizinische Fakultät",
"Universität Bern Medizinische Fakultät",
"Universität Zürich Medizinische Fakultät",
"Université de Fribourg Faculté des Sciences et de Médecine",
"Université de Genève Faculté de Médecine",
"Université de Lausanne Faculté de Biologie et de Médecine",
"Al Andalus University for Medical Sciences Faculty of Medicine",
"Al-Baath University Faculty of Medicine",
"Al-Furat University Faculty of Medicine",
"Idleb University Faculty of Medicine",
"Kalamoon University Faculty of Medicine",
"Syrian Private University",
"University of Aleppo Faculty of Medicine",
"University of Damascus Faculty of Medicine",
"University of Hama Faculty of Human Medicine",
"University of Tartous College of Medicine",
"University of Tishreen Faculty of Medicine",
"Avicenna Tajik State Medical University",
"Hubert Kairuki Memorial University Faculty of Medicine",
"International Medical & Technological University College of Medicine",
"Kilimanjaro Christian Medical University College",
"Muhimbili University of Health and Allied Sciences School of Medicine",
"University of Dodoma College of Health Sciences",
"Weill Bugando School of Medicine, Catholic University of Health and Allied Sciences",
"Burapha University Faculty of Medicine",
"Chiang Mai University Faculty of Medicine",
"Chulalongkorn University Faculty of Medicine",
"Faculty of Medicine and Public Health, HRH Princess Chulabhorn College of Medical Science",
"Faculty of Medicine Vajira Hospital",
"Khon Kaen University Faculty of Medicine",
"King Mongkut's Institute of Technology Ladkrabang Faculty of Medicine",
"Mae Fah Luang University School of Medicine",
"Mahasarakham University Faculty of Medicine",
"Naresuan University Faculty of Medicine",
"Phramongkutklao Medical College",
"Prince of Songkla University Faculty of Medicine",
"Princess of Naradhiwas University Faculty of Medicine",
"Ramathibodi Hospital Faculty of Medicine",
"Rangsit University Faculty of Medicine",
"Siam University Faculty of Medicine",
"Siriraj Hospital Faculty of Medicine",
"Srinakharinwirot University Faculty of Medicine",
"Suranaree University of Technology Institute of Medicine",
"Thammasat University Faculty of Medicine",
"Ubon Ratchathani University College of Medicine and Public Health",
"University of Phayao School of Medicine",
"Walailak University School of Medicine",
"Université de Lomé au Togo Faculté des Sciences de la Santé",
"University of the West Indies Faculty of Medicine St. Augustine, Trinidad",
"Faculté de Médecine 'Ibn El Jazzar' de Sousse",
"Faculté de Médecine de Monastir",
"Faculté de Médecine de Sfax",
"Faculté de Médecine de Tunis",
"Acibadem Mehmet Ali Aydinlar Üniversitesi Tıp Fakültesi",
"Adiyaman Üniversitesi Tıp Fakültesi",
"Adnan Menderes Üniversitesi Tıp Fakültesi",
"Afyonkarahisar Sağlık Bilimleri Üniversitesi Tıp Fakültesi",
"Ahi Evran Üniversitesi Tıp Fakültesi",
"Akdeniz Üniversitesi Tıp Fakültesi",
"Alanya Alaaddin Keykubat Üniversitesi Tıp Fakültesi",
"Altınbaş Üniversitesi Tıp Fakültesi",
"Amasya Üniversitesi Tıp Fakültesi",
"Ankara Yildirim Beyazit Üniversitesi Tıp Fakültesi",
"Ankara Üniversitesi Tıp Fakültesi",
"Ataturk Üniversitesi Tıp Fakültesi",
"Atılım Üniversitesi Tıp Fakültesi",
"Bahçeşehir Üniversitesi Tıp Fakültesi",
"Balikesir Üniversitesi Tıp Fakültesi",
"Baskent Üniversitesi Tıp Fakültesi",
"Beykent Üniversitesi Tıp Fakültesi",
"Bezmialem Vakif Üniversitesi Tıp Fakültesi",
"Biruni Üniversitesi Tıp Fakültesi",
"Bolu Abant Izzet Baysal Üniversitesi Tıp Fakültesi",
"Bozok Üniversitesi Tıp Fakültesi",
"Canakkale Onsekiz Mart Üniversitesi Tıp Fakültesi",
"Celal Bayar Üniversitesi Tıp Fakültesi",
"Cukurova Üniversitesi Tıp Fakültesi",
"Cumhuriyet Üniversitesi Tıp Fakültesi",
"Dicle Üniversitesi Tıp Fakültesi",
"Dokuz Eylül Üniversitesi Tıp Fakültesi",
"Düzce Üniversitesi Tıp Fakültesi",
"Ege Üniversitesi Tıp Fakültesi",
"Erciyes Üniversitesi Tıp Fakültesi",
"Erzincan Binali Yıldırım Üniversitesi Tıp Fakültesi",
"Eskişehir Osmangazi Üniversitesi Tıp Fakültesi",
"Firat Üniversitesi Tıp Fakültesi",
"Gazi Üniversitesi Tıp Fakültesi",
"Gaziantep Üniversitesi Tıp Fakültesi",
"Gaziosmanpasa Üniversitesi Tıp Fakültesi",
"Giresun Üniversitesi Tıp Fakültesi",
"Hacettepe Üniversitesi Tıp Fakültesi",
"Haliç Üniversitesi Tıp Fakültesi",
"Harran Üniversitesi Tıp Fakültesi",
"Hitit Üniversitesi Tıp Fakültesi",
"Kafkas Üniversitesi Tıp Fakültesi",
"Kahramanmaras Sütçü Imam Üniversitesi Tıp Fakültesi",
"Karabuk Üniversitesi Tıp Fakültesi",
"Karadeniz Teknik Üniversitesi Tıp Fakültesi",
"Kastamonu Üniversitesi Tıp Fakültesi",
"Kirikkale Üniversitesi Tıp Fakültesi",
"Kocaeli Üniversitesi Tip Fakültesi",
"Koç Üniversitesi Tıp Fakültesi",
"KTO Karatay Üniversitesi Tıp Fakültesi",
"Kütahya Sağlık Bilimleri Üniversitesi Tıp Fakültesi",
"Lokman Hekim Üniversitesi Tıp Fakültesi",
"Maltepe Üniversitesi Tıp Fakültesi",
"Marmara Üniversitesi Tıp Fakültesi",
"Meram Tıp Fakültesi",
"Mersin Üniversitesi Tıp Fakültesi",
"Muğla Sıtkı Koçman Üniversitesi Tıp Fakültesi",
"Namik Kemal Üniversitesi Tıp Fakültesi",
"Niğde Ömer Halisdemir Üniversitesi Tıp Fakültesi",
"Okan Üniversitesi Tıp Fakültesi",
"Ondokuz Mayis Üniversitesi Tıp Fakültesi",
"Ordu Üniversitesi Tıp Fakültesi",
"Pamukkale Üniversitesi Tıp Fakültesi",
"Recep Tayyip Erdogan Üniversitesi Tıp Fakültesi",
"Sakarya Üniversitesi Tıp Fakültesi",
"Sanko Üniversitesi Tıp Fakültesi",
"Sağlık Bilimleri Üniversitesi Gülhane Tıp Fakültesi",
"Sağlık Bilimleri Üniversitesi Hamidiye Tıp Fakültesi",
"Sağlık Bilimleri Üniversitesi Hamidiye Uluslararası Tıp Fakültesi",
"Selçuk Üniversitesi Tıp Fakültesi",
"Süleyman Demirel Üniversitesi Tıp Fakültesi",
"Tayfur Ata Sökmen Tıp Fakültesi, Mustafa Kemal Üniversitesi",
"TOBB Ekonomi ve Teknoloji Üniversitesi Tıp Fakültesi",
"Trakya Üniversitesi Tıp Fakültesi",
"Ufuk Üniversitesi Tıp Fakültesi",
"Uludag Üniversitesi Tıp Fakültesi",
"Uşak Üniversitesi Tıp Fakültesi",
"Van Yüzüncü Yil Üniversitesi Tıp Fakültesi",
"Yeditepe Üniversitesi Tıp Fakültesi",
"Yeni Yüzyil Üniversitesi Tıp Fakültesi",
"Yüksek İhtisas Üniversitesi Tıp Fakültesi",
"Zonguldak Bülent Ecevit University Tıp Fakültesi",
"Üsküdar Üniversitesi Tıp Fakültesi",
"İnönü Üniversitesi Tıp Fakültesi",
"İstanbul Aydın Üniversitesi Tıp Fakültesi",
"İstanbul Bilim Üniversitesi Tıp Fakültesi",
"İstanbul Medeniyet Üniversitesi Tıp Fakültesi",
"İstanbul Medipol University International School of Medicine",
"İstanbul Medipol Üniversitesi Tıp Fakültesi",
"İstanbul Üniversitesi - Cerrahpasa, Cerrahpasa Tıp Fakültesi",
"İstanbul Üniversitesi, İstanbul Tıp Fakültesi",
"İstinye Üniversitesi Tıp Fakültesi",
"İzmir Demokrasi Üniversitesi Tıp Fakültesi",
"İzmir Ekonomi Üniversitesi Tıp Fakültesi",
"İzmir Kâtip Çelebi Üniversitesi Tıp Fakültesi",
"İzmir Tınaztepe Üniversitesi Tıp Fakültesi",
"State Medical University of Turkmenistan",
"Busitema University Faculty of Health Science",
"Gulu University Faculty of Medicine",
"Habib Medical School, Islamic University in Uganda",
"Kampala International University Faculty of Medicine and Dentistry",
"King Ceasor University College of Medicine, Health and Life Sciences",
"Makerere University School of Medicine",
"Mbarara University of Science and Technology Faculty of Medicine",
"Uganda Christian University Medical School",
"Bogomolets National Medical University",
"Bohdan Khmelnytsky National University of Cherkasy Institute of Medicine",
"Bukovinian State Medical University",
"Danylo Halytsky Lviv National Medical University",
"Dnipro Institute of Medicine and Public Health",
"Dnipro Medical Institute of Traditional and Non-Traditional Medicine",
"Dnipro State Medical University",
"Donetsk National Medical University Faculty of General Medicine",
"I. Ya. Horbachevsky Ternopil National Medical University",
"International Academy of Ecology and Medicine",
"International European University European Medical School",
"International Humanitarian University Odessa Medical Institute",
"Ivano-Frankivsk National Medical University",
"Kharkiv Institute of Medicine and Biomedical Sciences Faculty of Medicine",
"Kharkiv International Medical University",
"Kharkiv National Medical University",
"Kyiv International University Medical Institute",
"Kyiv Medical University Faculty of Medicine",
"Lesya Ukrainka Volyn National University Medical Institute",
"Lugansk State Medical University",
"Lviv Medical Institute",
"Medical Academy named after S.I. Georgievsky of Vernadsky CFU",
"Odessa National Medical University",
"Oles Honchar Dnipro National University",
"Petro Mohyla Black Sea National University Faculty of Medicine",
"South Ukrainian National Pedagogical University named after K.D. Ushynsky Faculty of Medicine",
"Sumy State University Medical Institute",
"Taras Shevchenko National University of Kyiv Institute of Biology and Medicine",
"Ukrainian Medical Stomatological Academy",
"Ukrainian Military Medical Academy",
"Uzhhorod National University Faculty of Medicine",
"V.N. Karazin Kharkiv National University School of Medicine",
"Vinnitsa National Pirogov Memorial Medical University",
"Zaporozhye State Medical University",
"Ajman University College of Medicine",
"Dubai Medical College for Girls",
"Gulf Medical University College of Medicine",
"Khalifa University College of Medicine and Health Sciences",
"Mohammed Bin Rashid University of Medicine and Health Sciences",
"RAK College of Medical Sciences",
"United Arab Emirates University College of Medicine and Health Sciences",
"University of Sharjah College of Medicine",
"Anglia Ruskin University School of Medicine",
"Aston Medical School",
"Barts and the London School of Medicine and Dentistry",
"Brighton and Sussex Medical School",
"Bristol Medical School, University of Bristol",
"Cardiff University School of Medicine",
"Edge Hill University Medical School",
"Edinburgh Medical School, College of Medicine and Veterinary Medicine, University of Edinburgh",
"Hull York Medical School",
"Imperial College London Faculty of Medicine",
"Keele University School of Medicine",
"Kent and Medway Medical School",
"King's College London GKT School of Medicine",
"Lancaster University Medical School",
"Leicester Medical School, University of Leicester",
"Manchester Medical School",
"Newcastle University Faculty of Medical Sciences",
"Norwich Medical School, University of East Anglia",
"Peninsula Medical School, University of Plymouth",
"Queen's University Belfast School of Medicine, Dentistry and Biomedical Sciences",
"Sheffield University School of Medicine and Biomedical Sciences",
"St. George's University of London",
"Swansea University Medical School",
"UCL Medical School",
"University of Aberdeen School of Medicine, Medical Sciences and Nutrition",
"University of Birmingham College of Medical and Dental Sciences",
"University of Buckingham Medical School",
"University of Cambridge School of Clinical Medicine",
"University of Central Lancashire School of Medicine",
"University of Dundee School of Medicine",
"University of Exeter College of Medicine and Health",
"University of Glasgow School of Medicine, Dentistry and Nursing",
"University of Leeds School of Medicine",
"University of Liverpool School of Medicine",
"University of Nottingham School of Medicine",
"University of Oxford Medical Sciences Division",
"University of Southampton Faculty of Medicine",
"University of St. Andrews School of Medicine",
"University of Sunderland School of Medicine",
"Warwick Medical School",
"Centro Latinoamericana de Economia Humana (CLAEH) Facultad de Medicina",
"Universidad de la República Facultad de Medicina",
"Akfa University Medical School",
"Andizhan State Medical Institute",
"Bukhara State Medical Institute named after Abu Ali Ibn Sino",
"Fergana Medical Institute of Public Health",
"Fergana State University Medical Centre",
"Nukus Branch of Tashkent Pediatric Medical Institute",
"Samarkand State Medical Institute",
"Tashkent Medical Academy",
"Tashkent Pediatric Medical Institute",
"Urgench Branch of Tashkent Medical Academy",
"Hills College of Medicine",
"Universidad Central de Venezuela Escuela de Medicina Jose Maria Vargas",
"Universidad Central de Venezuela Escuela de Medicina Luis Razetti",
"Universidad Centro-Occidental Lisandro Alvarado Decanato de Ciencias de la Salud",
"Universidad de Carabobo Facultad de Ciencias de la Salud, Aragua",
"Universidad de Carabobo Facultad de Ciencias de la Salud, Valencia",
"Universidad de Los Andes (Venezuela) Facultad de Medicina",
"Universidad de Oriente Escuela de Medicina, Nucleo de Anzoategui",
"Universidad de Oriente Escuela de Medicina, Nucleo de Bolivar",
"Universidad del Zulia Facultad de Medicina",
"Universidad Nacional Experimental de los Llanos Centrales Rómulo Gallegos Escuela de Medicina",
"Universidad Nacional Experimental Francisco de Miranda Área de Ciencias de la Salud",
"Can Tho University of Medicine and Pharmacy Faculty of Medicine",
"Dai Nam University Faculty of Medicine",
"Duy Tan University Faculty of Medicine",
"Hai Phong University of Medicine and Pharmacy",
"Hanoi Medical University",
"Hong Bang International University Faculty of Medicine",
"Hue University of Medicine and Pharmacy",
"Nguyen Tat Thanh University Faculty of Medicine",
"Pham Ngoc Thach University of Medicine Faculty of Medicine",
"Tan Tao University School of Medicine",
"Tay Nguyen University Faculty of Medicine and Pharmacy",
"Thai Binh University of Medicine and Pharmacy",
"Thai Nguyen University of Medicine and Pharmacy Faculty of Medicine",
"Tra Vinh University School of Medicine and Pharmacy",
"University of Danang Faculty of Medicine and Pharmacy",
"University of Medicine and Pharmacy of Ho Chi Minh City",
"University of Medicine and Pharmacy, Vietnam National University, Hanoi",
"Vietnam Military Medical University Faculty of Medicine",
"Vietnam National University of Ho Chi Minh City School of Medicine",
"Vietnam University of Traditional Medicine",
"Vin University College of Health Sciences",
"Vinh Medical University Faculty of Medicine",
"Vo Truong Toan University Faculty of Medicine",
"21 September University for Medical and Applied Sciences",
"Aden University Faculty of Medicine",
"Emirates International University College of Medicine and Health Sciences",
"Hadhramout University of Science and Technology College of Medicine and Health Sciences",
"Taiz University Faculty of Medicine and Health Science",
"Thamar University Faculty of Medicine & Health Sciences",
"University of Sana'a Faculty of Medicine and Health Sciences",
"University of Science and Technology Faculty of Medicine and Health Sciences",
"Cavendish University School of Medicine",
"Copperbelt University School of Medicine",
"Lusaka Apex Medical University",
"Mulungushi University School of Medicine and Health Sciences",
"Texila American University College of Medicine",
"University of Lusaka School of Medicine and Health Sciences",
"University of Zambia School of Medicine",
"National University of Science and Technology Faculty of Medicine",
"University of Zimbabwe College of Health Sciences"
]